{"_id":{"$oid":"59402cdfbfa46541761e3b43"},"lore":"Dota Allstars:","skills":[{"name":"Acid Spray","description":"Sprays high-pressure acid across a target area. Enemy units who step across the contaminated terrain take physical damage per second and have their armor reduced.Using traditional Alchemy from the Darkbrew family, Razzil concocts an acid that dissolves even the toughest metals.\n"},{"name":"Unstable Concoction","description":"Alchemist brews up an unstable concoction that he can throw at an enemy hero, to stun and deal damage. The longer the concoction brews, the more damage it deals and the longer the target is stunned. After 5 seconds, the brew reaches its maximum damage and stun time. However, after 7 seconds, the concoction will explode on Alchemist himself if not thrown.A silver lining to the failure of turning a mountain into gold, this volatile solution has destructive potential.\n"},{"name":"Throw Unstable Concoction","description":"Throw it before it blows up!\n"},{"name":"Goblin's Greed","description":"Alchemist synthesizes additional gold from his enemies. With each kill, Alchemist earns base bonus gold and extra bonus gold. If Alchemist kills another unit which yields gold within the next 30 seconds, an additional instance of Extra Bonus Gold is added to the total.While it is not a mountain, Razzil has mastered the conversion of smaller compounds to line his pockets.\n"},{"name":"Chemical Rage","description":"Alchemist causes his Ogre to enter a chemically induced rage, reducing base attack cooldown and increasing movement speed and HP regeneration.The brew Razzil gave to the Ogre during their prison bust has become a useful potion in the midst of combat.\n"}],"type":"Strength","name":"Alchemist"}
{"_id":{"$oid":"59402cdfbfa46541761e3b44"},"lore":"More information required... Dota Allstars:Forcibly raised from the dead by the Lich King to serve as his elite magical guard, the Lich has the burning cold of Northrend in his realm of control. Evoking numerous freezing blasts, his talent in life still remains in death. Delving into the essence of cold magic, he has the power to cause ice to condense into an orb that bounces from foe to foe, causing tremendous pain in its wake. Sacrificing his allies for magical power, the Lich is a murderer without a trace of warmth. Dota 2:In life, the frost-mage Ethreain (not yet a Lich) had used the threat of destructive ice to enslave entire kingdoms. His subjects, aided by a few desperate magicians, eventually grew bold enough to ambush him. Armed with enough charmed rope to bind him forever, they tied the frost mage to adamant weights and dropped him in a pool known chiefly for being bottomless. It wasn't. He only fell for a year or so before an outcrop snagged him. There he rested, dead but undecaying, until the geomancer Anhil thought to verify the legend of the supposedly bottomless Black Pool. Anhil's plumbline snarled with the ropes that bound the drowned magician, and up he hauled an unexpected prize. Thinking that by rendering the dead undead, he could question the Lich about the properties of the pool, he removed the bindings and commenced a simple rite of resurrection. Even the descendants of Ethreain's enemies were long forgotten by time, so there were none to warn Anhil against imprudence. But he learned the error of his judgment almost immediately, as Lich threw off the shackles and consumed him. Lich is one of the best heroes at controlling a lane, thanks to his Frost Nova and Sacrifice spells. Frost Blast is a strong nuke that slows its target, giving Lich a good harassment tool. Repeatedly casting Frost Blast and harassing with physical attacks is a surefire way to quickly bring an enemy hero to his knees. However, Frost Blast becomes even more dangerous when coupled with Sacrifice. This spell allows Lich to destroy an allied creep and gain mana based on its life. Using this spell helps Lich by giving him limitless mana for Frost Blast, and hinders his enemies by denying them the experience or gold they would have gained from the destroyed creep. By using Frost Blast and Sacrifice liberally, the Lich can quickly force any opponent to retreat from his lane. Later in the game Lich tends to slide into a support role, using his Ice Armor spell to buff the survivability of his allies, and deploying his devastating Chain Frost to damage his foes in team battles.","skills":[],"type":"Intelligence","name":"Lich"}
{"_id":{"$oid":"59402cdfbfa46541761e3b45"},"lore":"More information needed... Dota Allstars:Torment around me. Torment in me. Torment be with me. And let us conquer our foes. They do not understand our pain. Do you? No. Not a soul can. And for that, We shall make them feel the torment... The torment that inhabits my soul. Dota 2:Leshrac, Tormented Soul, is an entity torn from the heart of nature, a liminal being that exists half in one plane of existence, half in another. His penetrating intelligence is such that he can never ignore for a moment the agonizing horror at the heart of all creation. Once a great philosopher who sought the meaning of existence, he plumbed the depths of nature with the haunted Chronoptic Crystals, and was forever altered by the hideous mysteries thereby revealed to him. Now the darkest depths of his enlightenment are illumined only by the fitful glare of his arrogance. Like other elemental characters, he is completely at one with nature, but in his case it is a nature lurid and vile. He alone sees the evil truth of reality, and has no use for those who believe the cosmos reserves a special reward for those who practice benevolence.","skills":[{"name":"Split Earth","description":"Splits the earth under enemies. Deals damage and stuns for a short duration. Twisting nature to his vile will, the shifting earth consumes those unlucky enough to cross Leshrac's path.\n"},{"name":"Diabolic Edict","description":"Saturates the area around Leshrac with magical explosions that deal physical damage to enemy units and structures. The fewer units available to attack, the more damage those units will take. Lasts 8 seconds. Deals 40% more damage to buildings.  Chronoptic energy bursts from one plane to the other, evaporating anything it touches.\n"},{"name":"Lightning Storm","description":"Summons a lightning storm that blasts the target enemy unit, then jumps to nearby enemy units. Struck units are slowed by 75% for a duration. The Tormented Soul's mastery of the elements is evident in the massive storms that strike down armies before him.\n"},{"name":"Pulse Nova","description":"Creates waves of damaging energy around Leshrac, one per second, to damage nearby enemy units. Upgraded by Aghanim's Scepter: Increases damage*. If necessary, the Tormented Soul can manipulate space time itself, ravaging lesser beings.\n"}],"type":"Intelligence","name":"Leshrac"}
{"_id":{"$oid":"59402cdfbfa46541761e3b46"},"lore":"Dota Allstars: Of all the allies in the Sentinel's ranks, only one, is known by as many names and is feared in as many lands. Called Capt. CoCo by his mates, Jack Sparrow by other, The Legendary Mariner by some, but only a select few, know his real name and what it stands for. He can harness the powers of the depths to conjure torrential geysers that blast his enemies into the air. His elegant blade is sworn to the Seas and with each mighty swing it ebbs like the tides. Using a watery form of spacial magic, he can bring you back to your original destination. The Captain now sails towards the Scourge lands, aboard his Phantom vessel boosting the spirits of his comrades with his fabled Rum, paving the way for the victory of the Sentinel. He is Kunkka, Master and Commander of the seven seas. Dota 2: As Admiral of the mighty Claddish Navy, Kunkka was charged with protecting the isles of his homeland when the Demons of the Cataract made a concerted grab at the lands of men. After years of small sorties, and increasingly bold and devastating attacks, the Demon Fleet flung all its carnivorous ships at the Trembling Isle. Desperate, the Suicide-Mages of Cladd committed their ultimate rite, summoning a host of ancestral spirits to protect the fleet. Against the Demons, this was just barely enough to turn the tide. As Kunkka watched the Demons take his ships down one by one, he had the satisfaction of wearing away their fleet with his ancestral magic. But at the battle's peak, something in the clash of demons, men and atavistic spirits must have stirred a fourth power that had been slumbering in the depths. The waves rose up in towering spouts around the few remaining ships, and Maelraun the Tentacular appeared amid the fray. His tendrils wove among the ships, drawing demon and human craft together, churning the water and wind into a raging chaos. What happened in the crucible of that storm, none may truly say. The Cataract roars off into the void, deserted by its former denizens. Kunkka is now Admiral of but one ship, a ghostly rig which endlessly replays the final seconds of its destruction. Whether he died in that crash is anyone's guess. Not even Tidehunter, who summoned Maelraun, knows for sure.","skills":[{"name":"Torrent","description":"Summons a rising torrent that, after a short delay, hurls enemy units into the sky, stunning, dealing damage and slowing movement speed. An ancestral rush of water explodes from the center of the world, called upon by the Admiral.\n"},{"name":"Tidebringer","description":"Kunkka's legendary sword grants increased damage and cleaves a large area of effect in front of him for a single strike. A lost Claddish soul inhabits Kunkka's trusty Tidebringer, empowering it to destroy demons of the Cataract.\n"},{"name":"X Marks the Spot","description":"Targets a friendly or enemy Hero, marks their position with an X, and returns them to it after several seconds. Kunkka can trigger the return at any time during the duration. Lasts twice as long on allied heroes. The Admiral's set of arcane abilities includes some that can be used for battle as well as entertainment.\n"},{"name":"Return","description":"Returns the marked hero to the X.\n"},{"name":"Ghostship","description":"Summons a ghostly ship that sails through the battle before smashing apart, damaging and stunning all enemies caught near the wreckage. Allied heroes touched by the Ghostship are given a swig of The Admiral's Rum, receiving bonus movement speed and a delayed reaction to 50% of all incoming damage. The final ship of the Claddish Navy is nothing but a phantom, but it is all too real to the enemies of the Admiral.\n"}],"type":"Strength","name":"Kunkka"}
{"_id":{"$oid":"59402cdfbfa46541761e3b47"},"lore":"Dota Allstars:There once was a man in Lordaeron so consumed by greed that he was beyond remorse. Eventually caught trying to steal Prince Arthas' sacred ring, he was tried and hanged. Yet his body, so corrupted by his desire to steal, rose by itself in the form of a monstrous ghoul. So came into being N'aix, his old name long forgotten: the embodiment of lust and greed, bent on stealing the life of every living creature he encounters.Dota 2:In the dungeons of Devarque, a vengeful wizard lay in shackles, plotting his escape. He shared his cell with a gibbering creature known as N'aix, a thief cursed by the Vile Council with longevity, so that its life-sentence for theft and cozening might be as punishing as possible. Over the years, its chains had corroded, along with its sanity; N'aix retained no memory of its former life and no longer dreamt of escape. Seeing a perfect vessel for his plans, the wizard wove a spell of Infestation and cast his life-force into N'aix's body, intending to compel N'aix to sacrifice itself in a frenzy of violence while the mage returned to his body and crept away unnoticed. Instead, the wizard found his mind caught in a vortex of madness so powerful that it swept away his plans and shattered his will. Jarred to consciousness by the sudden infusion of fresh life, N'aix woke from its nightmare of madness and obeyed the disembodied voice that filled its skull, which had only the one thought: To escape. In that moment Lifestealer was born. The creature cast its mind into dungeon guards and soldiers, compelling them to open locks and cut down their companions, opening an unobstructed path to freedom while feeding on their lives. Lifestealer still wears the broken shackles as a warning that none may hold him, but on the inside remains a prisoner. Two minds inhabit the single form--a nameless creature of malevolent cunning, and the Master whose voice he pretends to obey.","skills":[{"name":"Rage","description":"Launch into a maddened rage, becoming Spell Immune, 100% resistant to magic damage and gaining increased attack speed. The madness and brutality of N'aix makes him a vicious and unrelenting foe in combat.\n"},{"name":"Feast","description":"Regenerates a portion of the attacked enemy's current HP and deals the same portion of damage per attack. After escaping from his cell in Devarque, N'aix subsisted on flesh and bones of those unfortunate enough to cross his path.\n"},{"name":"Open Wounds","description":"Lifestealer rends an enemy unit, slowing the victim's movespeed and allowing all allies to lifesteal on that unit. All damage dealt will steal life, including damage from spells. The victim recovers movement speed over the duration. Fresh wounds and the scent of blood often draw out the scavengers to finish the job.\n"},{"name":"Infest","description":"Lifestealer infests the body of a target unit, becoming undetectable inside. He can then explode from the host body, dealing damage to nearby enemies. If the infested unit is an enemy creep or a neutral creep, he can take control of the unit's ability to move and attack and when consumed the creep will heal Lifestealer's health equal to the creep's current health. Does not work on enemy heroes. Upgraded by Aghanim's Scepter: Grants Lifestealer the Assimilate ability. With this infestation, N'aix consumes the life blood of the host, restoring him back to full unholy power.\n"},{"name":"Control","description":"Lifestealer seizes control of the host body's nervous system, allowing him to issue movement and attack orders from within. Controlled units share Lifestealer's movement speed. Cannot be used on heroes.\n"},{"name":"Consume","description":"Lifestealer eats the host body from the inside out.\n"},{"name":"Assimilate","description":"Lifestealer swallows an allied hero, allowing them to hide inside him. Any healing Lifestealer receives is shared with the hero within. When an assimilated hero leaves Lifestealer, they erupt outwards, damaging nearby enemies. How can Lifestealer resist the chance to sample an ally?\n"}],"type":"Strength","name":"Lifestealer"}
{"_id":{"$oid":"59402cdfbfa46541761e3b48"},"lore":"More information required... Dota Allstars:","skills":[{"name":"Earth Spike","description":"Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and will take damage when they fall. The Demon Witch exercises his demonic covenant, opening a fissure from hell.\n"},{"name":"Hex","description":"Transforms an enemy unit into a harmless beast, with all special abilities disabled. Lion is compelled to share his transfiguration, twisting the essence of those who oppose him.\n"},{"name":"Mana Drain","description":"CHANNELED – Absorbs the magical energies of a target enemy unit by taking mana from it every second. Lesser magi are nothing more than a source of magical restoration for the Demon Witch.\n"},{"name":"Finger of Death","description":"Rips at an enemy unit, trying to turn it inside-out. Deals massive damage. Upgraded by Aghanim's Scepter: Increases damage, decreases cooldown and level 3 mana cost. Adds 200 damage radius*. Lion's disfigured hand is also the source of his greatest power, capable of flooding victims with malefic force.\n"}],"type":"Intelligence","name":"Lion"}
{"_id":{"$oid":"59402cdfbfa46541761e3b49"},"lore":"Dota Allstars:Master of light and mana manipulation, Ezalor was once viewed as a scholar, and was regarded as a powerful mentor to many. However, his defection and betrayal of his allies during the War of the Magi caused him to be sentenced to banishment to the spirit realm for all of eternity. However, knowing of his tremendous power, the Sentinel granted him a corporeal form within the physical realm in exchange for his alliance against the Scourge onslaught. As such, Ezalor carries his duties of supporting his comrades valiantly despite the treacherous past that most know little about.Dota 2:On a steel horse he rides, this spark of endless suns, this Keeper of the Light. Ezalor long ago escaped the Fundamental plane, separating from the other ancient forces to which he was bound within the great Primordial harmony. He is a power grown sentient in the dawn of the universe, and now rides forth in all planes at once, one step ahead of pursuing chaos, bearing his gift with him at the end of a radiant staff. His majestic truth lies hidden beneath the outward appearance of a slightly doddering old man who barely stays in the saddle. However, when faced with the challenge of chaos, or the forces of darkness, his primordial light bursts forth, and his full power is revealed, transforming him once again into a force to be reckoned with.","skills":[{"name":"Illuminate","description":"Channels a ball of light energy, building power the longer it's channeled. Once released, the ball deals damage and gives vision in a line. The longer it is channeled, the more damage dealt.  Upgraded by Aghanim's Scepter: Allows Illuminate to heal allies for 100% of its damage values during daytime. Ezalor's hidden light reveals itself in marvelous fashion.\n"},{"name":"Release Illuminate","description":"Ends the channeling on Illuminate and releases the spell with damage currently built-up.\n"},{"name":"Mana Leak","description":"Weakens an enemy's magical essence, causing their mana to drain with movement. If the enemy loses all of its mana, it will be stunned. Ezalor disrupts Primordial harmony, draining magical energy from those with poor constitution.\n"},{"name":"Chakra Magic","description":"Restores mana to the target unit and adds a buff that reduces the cooldown of the next spell the target casts. In the same vein, Ezalor bestows his harmony among others.\n"},{"name":"Spirit Form","description":"Ezalor temporarily turns his body luminescent, gaining various abilities. Illuminate is now channeled by a separate spirit, and gains the Blinding Light and Recall abilities. Upgraded by Aghanim's Scepter: Provides permanent Spirit Form. During daytime, grants unobstructed vision and Illuminate heals for 100% of its damage values. In a flash of light, Ezalor reveals his true nature.\n"},{"name":"Recall","description":"After a short delay, teleports the targeted friendly hero to your location. If the targeted friendly hero takes player based damage during this time, the ability is interrupted. Walk towards the light.\n"},{"name":"Blinding Light","description":"A blinding light flashes over the targeted area, knocking back and blinding the units in the area, causing them to miss attacks. The Primordial light turns the tides of battle in favor of Ezalor and his allies.\n"},{"name":"Illuminate (Spirit Form)","description":"Channels a ball of light energy, building power the longer it's channeled. Once released, the ball deals damage and gives vision in a line. The longer it is channeled, the more damage dealt. Upgraded by Aghanim's Scepter: Allows Illuminate to heal allies for 100% of its damage values during daytime. Ezalor's hidden light reveals itself in marvelous fashion\n"}],"type":"Intelligence","name":"Keeper_of_the_Light"}
{"_id":{"$oid":"59402cdfbfa46541761e3b4a"},"lore":"More information needed... DOTA 2:Even among magical beasts, a twin-headed dragon is a freak. Equal parts ice and fire, cunning and rage, the creature known as Jakiro glides over charred and ice-bound battlefields, laying waste to any who would bear arms against it. Pyrexae dragon clutches always contain two fledglings. Famous for their viciousness even from the first moments of life, newly hatched dragons of this species will try to kill their sibling while still in the nest. Only the strongest survive. In this way is the strength of the Pyrexae line ensured. By some accident of nature, the freak Jakiro hatches from a single egg, combining in a single individual the full range of abilities found within the diverse Pyrexae species. Trapped within the armature of its monstrous body, the powers of ice and fire combine, and now no enemy is safe.","skills":[{"name":"Dual Breath","description":"An icy blast followed by a wave of fire launches out in a path in front of Jakiro. The ice slows enemies, while the fire delivers damage over time. Pyrexae dragons have tremendously dangerous breath for each branch of the species; combining them is unimaginable.\n"},{"name":"Ice Path","description":"Creates a path of ice that stuns and damages enemies that touch it.Jakiro's cunning right head calls upon its frozen heritage, glazing the earth with blistering cold.\n"},{"name":"Liquid Fire","description":"Jakiro burns his enemies in an area of effect with fire added to his attack, while slowing their attacks.The left maw of Jakiro opens, laying waste to any in its path.\n"},{"name":"Macropyre","description":"Jakiro exhales a wide line of lasting flames, which deals damage per second to any enemy units caught in the fire. Upgraded by Aghanim's Scepter: Increases cast range, distance, duration, and damage. Ice and fire combine to rip the battlefield to shreds with extreme temperatures.\n"}],"type":"Intelligence","name":"Jakiro"}
{"_id":{"$oid":"59402ce0bfa46541761e3b4b"},"lore":"Dota Allstars: A renowned pyromancer roaming the lands, Lina Inverse originally joined the Sentinel for monetary purposes. However, weeks turned into months, and fighting alongside the many holy warriors with fearless souls inspired her with the responsibility of protecting the sanctity of the World Tree. With her devastating abilities to summon vaporizing flames, she wreaks havoc among the enemy ranks. In dire situations, she would imbue herself with an ultimate fervor, or even call forth a massive beam of lightning which is said to instantly slay any single foe. A most feared enemy of the Scourge, a most unswerving defender of the Sentinel.  Dota 2: The sibling rivalries between Lina the Slayer, and her younger sister  Rylai, the Crystal Maiden, were the stuff of legend in the temperate region where they spent their quarrelsome childhoods together. Lina always had the advantage, however, for while Crystal was guileless and naive, Lina's fiery ardor was tempered by cleverness and conniving. The exasperated parents of these incompatible offspring went through half a dozen homesteads, losing one to fire, the next to ice, before they realized life would be simpler if the children were separated. As the oldest, Lina was sent far south to live with a patient aunt in the blazing Desert of Misrule, a climate that proved more than comfortable for the fiery Slayer. Her arrival made quite an impression on the somnolent locals, and more than one would-be suitor scorched his fingers or went away with singed eyebrows, his advances spurned. Lina is proud and confident, and nothing can dampen her flame. The Slayer is one of the deadlier offensive spellcasters, capable of killing fragile heroes with one combo of her spells. Her two main offensive spells provide a powerful area of effect combo. Dragon Slave fires a quick fiery projectile which deals good damage and has pretty high range. Light Strike Array is Lina's stun spell. Due to her relatively slow cast time it can be difficult to hit moving enemies with this spell, however. Many Lina players cast Light Strike Array right after an ally uses another stun, making the spell much easier to hit and prolonging the total disable time. To support her offensive gameplay style, Lina has a passive skill called Fiery Soul. Every time she casts any of her other spells, Lina gains a temporary movement and attack speed bost, allowing her to chase down and kill fleeing enemies. Lina also has the most damaging single-target spell in the game: Laguna Blade. This devastating blast of energy is one of the best ways to finish off injured enemies. Often heroes who thought they were safe are blasted into oblivion by a single Laguna Blade. ","skills":[{"name":"Dragon Slave","description":"Lina channels the breath of a dragon, sending out a wave of fire that scorches every enemy in its path. In the scorched barren of Misrule, Lina learned to manipulate the fiery breath of the Desert Wyrm as a form of entertainment.\n"},{"name":"Light Strike Array","description":"Summons a column of flames that damages and stuns enemies. Lina's essence allows her to focus the sun's energies, causing air to combust at will.\n"},{"name":"Fiery Soul","description":"Grants bonus attack and movement speed each time Lina casts a spell. Stacks with itself. Dancing flames embody Lina's playful nature, bringing out her true blazing self.\n"},{"name":"Laguna Blade","description":"Fires off a bolt of lightning at a single enemy unit, dealing massive damage. Upgraded by Aghanim's Scepter: Changes Laguna Blade's damage type to Pure and allows it to slice through spell immunity. The air around Lina becomes so intensely torrid that it scorches a foe that came too close with white-hot lightning.\n"}],"type":"Intelligence","name":"Lina"}
{"_id":{"$oid":"59402ce0bfa46541761e3b4c"},"lore":" Dota 2:Lord of Heaven, father of gods, Zeus treats all the Heroes as if they are his rambunctious, rebellious children. After being caught unnumbered times in the midst of trysts with countless mortal women, his divine wife finally gave him an ultimatum: 'If you love mortals so much, go and become one. If you can prove yourself faithful, then return to me as my immortal husband. Otherwise, go and die among your creatures.' Zeus found her logic (and her magic) irrefutable, and agreed to her plan. He has been on his best behavior ever since, being somewhat fonder of immortality than he is of mortals. But to prove himself worthy of his eternal spouse, he must continue to pursue victory on the field of battle.","skills":[{"name":"Arc Lightning","description":"Hurls a bolt of lightning that leaps through nearby enemy units.\n"},{"name":"Lightning Bolt","description":"Summons a bolt of lightning to strike an enemy unit, causing damage and a mini-stun. Lightning Bolt also provides Flying Vision and True Sight around the target area. Can be cast on a target point, damaging the closest enemy hero within range..\n"},{"name":"Static Field","description":"Zeus shocks all nearby enemy units whenever he casts a spell, causing damage proportional to their current health.\n"},{"name":"Thundergod's Wrath","description":"Strikes all enemy heroes with a bolt of lightning, no matter where they may be. Thundergod's Wrath also provides True Sight around each hero struck. If an enemy hero is invisible, it takes no damage, but the True Sight is still created at that hero's location. Upgradable by Aghanim's Scepter.\n"}],"type":"Intelligence","name":"Zeus"}
{"_id":{"$oid":"59402ce0bfa46541761e3b4d"},"lore":"Dota Allstars:The Trolls of the Darkspear tribe, long since exiled from their ancestral lands in Stranglethorn Vale, are considered by many to be the most savage race of creatures to ever grace the battlefield. This reputation is well earned by their Sentinel representative Huskar, who's abilities revolve around shortening his own lifespan to spear his foes to burning pieces. Considered a blessed martyr by his people, the Sacred Warrior is not afraid of death, and will even run towards it willingly, sometimes desperately, in order to bring the Undead Scourge to an end.","skills":[{"name":"Inner Vitality","description":"Unlocks the regenerative power of a friendly unit, with healing based upon its primary attribute. If the target is below 40% it will heal faster. Lasts 16 seconds.  While Huskar has little use for magic, this minor enchantment was learned from the Dazzle and the Dezun priests, to be used in times of great injury.\n"},{"name":"Burning Spears","description":"Huskar sets his spears aflame, dealing damage over time with his regular attack. Multiple attacks will stack additional damage. Each attack drains some of Huskar's health. Lasts 8 seconds. The Sacred Warrior ignites his weaponry after marking it with his own blood - causing far greater pain than he himself feels.\n"},{"name":"Berserker's Blood","description":"Huskar's injuries feed his power, giving increased attack speed and magic damage resistance based on missing health. After losing his birthright, Huskar gained a lethality in physical combat that is only heightened as his own blood is spilled.\n"},{"name":"Life Break","description":"Huskar draws upon his health to break an enemy's life, leaping at a target within attack range to shatter a percentage of that hero's current health, and slowing them. While leaping, Huskar is spell immune. Upgraded by Aghanim's Scepter: Increases damage dealt, reduces cooldown. No matter the danger, Huskar thrusts himself into melees that only he can survive.\n"}],"type":"Strength","name":"Huskar"}
{"_id":{"$oid":"59402ce0bfa46541761e3b4e"},"lore":"[Needs more Information] Dota 2:Darkterror the Faceless Void is a visitor from Claszureme, a realm outside of time. It remains a mystery why this being from another dimension believes the struggle for the Nemesis Stones is worth entering our physical plane, but apparently an upset in the balance of power in this world has repercussions in adjacent dimensions. Time means nothing to Darkterror, except as a way to thwart his foes and aid his allies. His long-view of the cosmos has given him a remote, disconnected quality, although in battle he is quite capable of making it personal.","skills":[{"name":"Time Walk","description":"Rushes to a target location while slowing the movement and attack speed of all enemies along its path for 3 seconds. Darkterror tears a hole in time, passing through Claszureme, and appearing back in an instant.\n"},{"name":"Backtrack","description":"Faceless Void dodges damage by jumping backward in time, eluding both physical and magical attacks. Darkterror sees what has yet to be seen.\n"},{"name":"Time Lock","description":"Adds the chance for an attack to lock an enemy unit in time, stunning it and dealing bonus damage. The duration is twice as long against creeps. The strike of the Faceless Void lands with dimension shifting force.\n"},{"name":"Chronosphere","description":"Creates a blister in spacetime, trapping all units caught in its sphere of influence and causes you to move very quickly inside it. Only Faceless Void and any units he controls are unaffected. Invisible units in the sphere will be revealed. Upgraded by Aghanim's Scepter: Increases duration and decreases cooldown*. When a rift opens to Claszureme, all poor souls caught within will likely never return.\n"}],"type":"Agility","name":"Faceless_Void"}
{"_id":{"$oid":"59402ce0bfa46541761e3b4f"},"lore":"Break Tether Spirits In SPIRITS OUT – Sends the spirits farther away from you. Can be toggled on and off. Dota Allstars: Originally nothing more than a lowly spirit of the trees, Io dwelt peacefully amongst his kind in the Great Forest. As the Great War spread across the land the creatures of the forest were forced to defend their home. The desire to protect his kin awoke power in Io he had not known he possessed. He discovered he was able to connect his life force to another creature to strengthen them or help them flee by instantly transporting them out of harm. Io became known amongst his people as the Guardian Wisp, a protector of the Spirits. All other spirits swore to assist him and can be summoned to his side to aid him in his battle. Uninterested in the battle between the Sentinel and the Scourge, Io fights only to protect his people.Dota 2:Wisp is everywhere, and in all things. Denounced by enemies as the great unmaker, worshiped by scholars as the twinkling of a divine eye, Wisp occupies all planes at once, the merest fraction of its being crossing into physical existence at any one moment. ","skills":[{"name":"Tether","description":"ACTIVE – Tether yourself to an allied hero granting both of you bonus movement. When you heal health or mana your target gains the same amount. Stuns any enemy unit that crosses the tether. Breaks when they distance is too great or you cancel the tether.\nDEACTIVE – Break the link to the unit you are tethered to.\n\n"},{"name":"Spirits","description":"ACTIVE – Summon five spirits that dance in a circle damaging all that they hit around you. If the wisp hits an enemy hero they will explode damaging all in an area around them.\nSPIRITS IN – Calls the spirits closer to you. Can be toggled on and off.\nSPIRITS OUT – Sends the spirits farther away from you. Can be toggled on and off.\n\n"},{"name":"Overcharge","description":"You and any unit that you have tethered gain increased attack speed and damage resistance at the cost of draining 2.5% of your health and mana per second.\n"},{"name":"Relocate","description":"CHANNELED – Teleport yourself and any tethered ally to any location on the map. After the spell expires you and any tethered ally will return to where you teleported from.\n"}],"type":"Strength","name":"Wisp"}
{"_id":{"$oid":"59402ce0bfa46541761e3b50"},"lore":"More information needed. Dota Allstars: Former cultist of the Blacksun, Lannik was among the first of many orcs enslaved by the wretched demons when the Legion's taint befell the lands of Kalimdor - a dire affliction that grew stronger over the years. Mannoroth's sudden and unexpected demise severed this Warlock's ties to demonology, and the absence of its corrupting influenced caused his body to wither onto the verge of death. In exchange for life beyond the grave, he bound a pact with the Lich King. A master of demons and destructive spellwork, this warlock delights in tormenting creatures of the Light, extinguishing them like candles until none are left alive. Dota 2:As Chief Curator and Head of Acquisitions for the Arcane Archives of the Ultimyr Academy, Demnok Lannik was tireless in his pursuit of lost, rare and forbidden tomes. No cursed temple was so foreboding, no cavern path so treacherous, that any concern for his own survival could dissuade him from entering if rumors hinted that some pamphlet of primordial lore might still survive in its depths. However, so often did his investigations trigger the wrath of protector entities, that he finally found it necessary to master the arts of magic. He bent himself to learning sorcery with the same thorough obsessiveness that marked his quest for incunabula, becoming the most powerful Warlock of the Academy in less time than most practitioners required to complete a course of undergraduate work. Almost as an afterthought, he carved a staff of Dreadwood and summoned into it a captive spirit from the Outer Hells. And anticipating the day when he will have recovered every last lost spellbook, he has commenced writing his own Black Grimoire. It will undoubtedly be instructive.","skills":[{"name":"Fatal Bond","description":"Binds several enemy units together, causing 20% of the damage dealt to one of them to be felt by the others.\n"},{"name":"Shadow Word","description":"Demnok whispers an incantation, healing a friendly unit or damaging an enemy unit over time.\n"},{"name":"Upheaval","description":"A powerful slowing current that grows stronger as it's channelled. Lasts up to 10 seconds, slowing enemies up to 84%. Enemies are slowed for 3 seconds after leaving the area or the spell ends.\n"},{"name":"Chaotic Offering","description":"Summons a Golem from the depths, dealing 100 damage and stunning enemies for one second. The Golem lives for 60 seconds, takes reduced damage from spells, has Permanent Immolation and Flaming Fists on attack.\nUpgraded by Aghanim's Scepter: Calls 2 Golems, HP and damage are decreased by 25%, and bounty by 50% per golem.\n\n"},{"name":"Warlock's Golem","description":"The golem summoned by Warlock's Chaotic Offering ability. The golem's abilities are detailed below and his stats on the right.\n"},{"name":"Flaming Fists","description":"Grants a chance to deal extra damage to nearby units when attacking.\n"},{"name":"Permanent Immolation","description":"Burns the Golem's nearby enemy units, with damage per second.\n"}],"type":"Intelligence","name":"Warlock"}
{"_id":{"$oid":"59402ce0bfa46541761e3b51"},"lore":"Damage Per Attack: 15/20/25/30 Dota Allstars: Anub'seran. The name of this creature strikes fear into all of those who have seen the Nerubians. Even the famed assassin Anub'arak is hesitant to fight this beast, which comes from the plane of the spirit world. He can swiftly walk through his enemies, bending their bodies to his will, causing pain while he strides through them. With his powers over the timeless plane, he can also step inside and throw himself into the past to keep himself from death. He can call an attack from the future to strike his foes, making his onslaught more deadly. Anub'seran. Only the fools do not fear his name. Dota 2: The fabric of creation needs constant care, lest it grow tattered; for when it unravels, whole worlds come undone. It is the work of the Weavers to keep the fabric tight, to repair worn spots in the mesh of reality. They also defend from the things that gnaw and lay their eggs in frayed regions, whose young can quickly devour an entire universe if the Weavers let their attention lapse. Skitskurr was a master Weaver, charged with keeping one small patch of creation tightly woven and unfaded. But the job was not enough to satisfy. It nagged him that the original work of creation all lay in the past; the Loom had done its work and travelled on. He wanted to create rather than merely maintain—to weave worlds of his own devising. He began making small changes to his domain, but the thrill of creation proved addictive, and his strokes became bolder, pulling against the pattern that the Loom had woven. The guardians came, with their scissors, and Weaver's world was pared off, snipped from the cosmic tapestry, which they rewove without him in it. Skitskurr found himself alone, apart from his kind, a state that would have been torment for any other Weaver. But Skitskurr rejoiced, for now he was free. Free to create for himself, to begin anew. The raw materials he needed to weave a new reality were all around him. All he had to do was tear apart this old world at the seams.","skills":[{"name":"The Swarm","description":"Weaver launches a swarm of 12 beetles that latch on any enemy unit in their path, attacking it and reducing its armor until it is killed.\n"},{"name":"Shukuchi","description":"Weaver shifts out of visibility, gaining the ability to move at maximum speed and pass through units--doing harm to any enemies it passes through.\n"},{"name":"Geminate Attack","description":"Allows Weaver to dispatch two swarms instead of one, attacking an enemy twice.\nGeminate Attack has a cooldown. The extra attack will not trigger other attack effects (such as critical strike) and overrides Unique Attack Modifiers. \n\n"},{"name":"Time Lapse","description":"Weaver warps backward to whatever position it was in five seconds earlier--regaining the HP and mana from that time. No effect on cooldown, gold or experience.\n"}],"type":"Agility","name":"Weaver"}
{"_id":{"$oid":"59402ce0bfa46541761e3b52"},"lore":"Dota Allstars:","skills":[{"name":"Earthshock","description":"Ursa slams the earth, causing a powerful shockwave to damage and slow all enemy units in a nearby area for 4 seconds.\n"},{"name":"Overpower","description":"Using his skill in combat, Ursa gains a huge increase in attack speed for a set number of attacks, or until the duration expires.\n"},{"name":"Fury Swipes","description":"Ursa's claws cause deep wounds in the enemy, causing consecutive attacks to the same enemy to deal more damage. Each hit on the same target within 6 seconds( including the first hit) deals damage and increases the damage taken by subsequent attacks. If the same target is not attacked after 6 seconds, the bonus damage is lost.\nFury Swipes is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers. \n\n"},{"name":"Enrage","description":"Ulfsaar harnesses his animalistic fury, Multiplying his fury swipes damage and ignoring 80% of incoming damage.\n"}],"type":"Agility","name":"Ursa"}
{"_id":{"$oid":"59402ce0bfa46541761e3b53"},"lore":"","skills":[],"type":"Intelligence","name":"Windrunner"}
{"_id":{"$oid":"59402ce0bfa46541761e3b54"},"lore":"Level 2 - Deals 175 damage and stuns for 1.55 seconds. Level 2 - Reduces base armor by 3. Deals 37.5 damage. Level 2 - 20% damage. Level 2 - 900 range. Dota Allstars:Once a mighty warden and sister of Mortred, the maniacal laughter of her sibling and the chakram of hers covered in her own just drawn blood is a sight that even today still haunts Shendelzare. Hearing the laments of her loyal daughter, Elune decided to not forsake her, and she graced her with a new body along with the ability to harness powers from the nether-world and a fighting spirit only owned by those who have met death itself. Shendelzare now leads the Sentinel's army, fearless of what could come at her, an avatar of the dreadful emotions within the soul of her former self. Dota 2:Even the most contented Skywrath is an ill-tempered creature, naturally inclined to seek revenge for the slightest insult. But Vengeful Spirit is the essence of vengeance. Once a proud and savage Skywrath scion, first in succession for the Ghastly Eyrie, a sister's treachery robbed her of her birthright. Snared in a hired assassin's net, she tore free only at the cost of her wings, limping away in the ultimate humiliation: On foot. With her wings shattered, she knew her people would never accept her as ruler; and in the high roost of the Skywrath flock, inaccessible except by winged flight, her sister was untouchable. Unwilling to live as a flightless cripple, and desiring revenge far more than earthly power, the fallen princess drove a bargain with the goddess Avilliva Scree'auk: She surrendered her broken body for an imperishable form of spirit energy, driven by vengeance, capable of doing great damage in the material plane. She may spend eternity flightless, but she will have her revenge.","skills":[{"name":"Magic Missile","description":"Fires a magic missile at an enemy unit, stunning and dealing damage.\n"},{"name":"Wave of Terror","description":"Vengeful Spirit lets loose a wicked cry, weakening the armor of enemies and giving vision of the path.\n"},{"name":"Vengeance Aura","description":"Vengeful Spirit's presence increases nearby friendly units' physical damage. When Vengeful Spirit is killed, her killer is inflicted with a negative Vengeance Aura, decreasing their damage until she revives.\n"},{"name":"Nether Swap","description":"Instantaneously swaps positions with a target Hero, friend or enemy.\n"}],"type":"Agility","name":"Vengeful_Spirit"}
{"_id":{"$oid":"59402ce1bfa46541761e3b55"},"lore":"More information needed... DOTA 2:The Tidehunter known as Leviathan was once the champion of the Sunken Isles, but his motives are as mysterious as those of his people. We all know the importance of the Drylanders' shipping lanes, how empires may rise and fall according to who controls the open water. Far less is known of the submarine lanes, and how the warring tribes of the Meranthic Diaspora have carved out habitations through endless undersea skirmishes. In the fragile treaties between the Mer and Men, we can glimpse the extent of the drowned empires, but their politics appear complex and opaque. It would seem that Leviathan tired of such petty strife, and set off on his own, loyal only to his abyssal god, Maelrawn the Tentacular. He stalks the shallows now in search of men or meranths who stray into his path, and with a particular loathing for Admiral Kunkka, who has long been his nemesis for reasons lost in the deepest trenches of the sea. A massive leviathan of incredible strength and toughness, Tidehunter is a real tank. Using his Gush skill, he can slow and damage a single target while reducing their armor, allowing him and his allies to pummel the target to a pulp. To aid his close combat skills, Tidehunter has a powerful Anchor Smash spell, which he can use to unleash a devastating area of effect spin attack. A target of Gush who is hit by an Anchor Smash or two is in deep trouble. To protect himself while chasing down and smashing enemies, Tidehunter has a passive: Kraken Shell. This ability reduces all damage from physical attacks by a set number, allowing the Leviathan to wade into combat without fear, ignoring the blows of lesser foes. Kraken Shell also occasionally dispels negative spell effects, making him even more difficult to stop. By far the most feared ability of the Tidehunter is Ravage. This mighty ability allows the Tidehunter to cause immense damage and stun all enemies in a large area around him. This ability is most effective in large team battles, where it is a simple matter to hit the entire enemy team at once with its writhing tentacles, setting up the Tidehunter and his allies for an easy victory.","skills":[],"type":"Strength","name":"Tidehunter"}
{"_id":{"$oid":"59402ce1bfa46541761e3b56"},"lore":"Dota Allstars:A treant of immense age and wisdom, Rooftrellen was merely a sapling during the invasion of the Burning Legion. Having grown powerful over thousands of years, Rooftrellen has lent his considerable might to the Sentinel cause. An omnipresent force in the forest, he is capable using his power over the forest to hide his allies. Rooftrellen is aided by the forest itself, providing him with a thick living armor of vines and entangling nearby foes in a deadly embrace, allowing Rooftrellen to pound his victims to dust with his massive gnarled limbs.Dota 2:Far to the west, in the mountains beyond the Vale of Augury, lie the remains of an ancient power, a fount of eldritch energy nestled deep in the high woods. It is said that the things that grow here, grow strangely. To the forces of nature this is a sacred place, made to stay hidden and unknown. Many are the traps and dangers of this land--all-consuming grasses and crossbred fauna and poisonous flowers--but none are so fierce as the mighty Treant Protectors. These ageless, titanic beings, charged with keeping the peace in this dangerous land, ensure that none within encroach without reason, and none without poach their secrets. For time untold they tended to their holy ground, uninterrupted, only dimly aware of the changing world beyond. Yet inevitably the wider world grew aware of this untamed land, and with each passing winter the outsiders grew bolder. Soon they arrived with tools to cut and with flames to burn, and often the Treants would ponder: who are these fragile, industrious creatures? What now had become of the wild, green world? There came and went an age of questions and of doubts, a thousand summers of long traditions set to scrutiny, while more and more the outsiders died and fed their earth. When all that bloomed had finally finished their say, curiosity had overcome caution. It was decided: a lone Protector would be sent into the wider world, and instructed to wander until the glaciers arose once more, to observe the changing land and its creatures, and to discover what unknown dangers could threaten their sacred ground.","skills":[{"name":"Nature's Guise","description":"Causes the targeted unit to blend in with the forest, becoming invisible to enemies and gaining a movement speed bonus when near a tree. If the unit moves away from a tree or the spell is cast on a unit with no nearby trees, Guise is lost.\n"},{"name":"Leech Seed","description":"Rooftrellen plants a life-sapping seed in an enemy unit, draining its health, while simultaneously slowing it. The seed heals friendly units around it equal to the amount drained. Pulses 4 times.\n"},{"name":"Living Armor","description":"Infuses allied heroes and structures with a protective healing aura, increasing armor and regeneration. During the day, the aura that affects heroes extends globally, while for structures and at night, the aura radius shortens.\n"},{"name":"Overgrowth","description":"Summons an overgrowth of damaging vines and branches around Rooftrellen that prevent afflicted enemies from moving or attacking. Deals damage once per second.\n"}],"type":"Strength","name":"Treant_Protector"}
{"_id":{"$oid":"59402ce1bfa46541761e3b57"},"lore":"Dota 2: Perched atop the entrance to the Narrow Maze sit the looming shapes of sneering gargoyles, the paths into the hereafter forever in their gaze. Beasts and birds, men and monsters, all creatures that die and choose to travel beyond must someday pass beneath their sight. For an untethered spirit, the decision to journey through the veil of death is irrevocable. When chance comes, and by craft or cunning some restless soul escapes their hells and heavens, it is the dreaded gargoyle Visage, the bound form of the eternal spirit Necro’lic, who is dispatched to reclaim them. Ruthless and efficient, unhindered by the principles of death and fatigue, Visage stalks its prey without mercy or end, willingly destroying all which may give shelter to the fugitive essence. That which flaunts the laws of the afterlife may never rest, for while it is true that the dead may be revived, it is only a matter of time before Visage finds and returns them to their proper place.","skills":[{"name":"Grave Chill","description":"Visage drains the movement and attack speed of the targeted unit, gaining it for itself.\n"},{"name":"Soul Assumption","description":"Visage damages the targeted unit based on the number of soul charges. Visage gains a soul charge when damage taken by all heroes around him reaches the damage threshold.\n"},{"name":"Gravekeeper's Cloak","description":"Visage generates a layered barrier that protects him from physical and magical attacks. If he receives damage from a player, one layer is removed, and takes time to recover.\n"},{"name":"Summon Familiars","description":"Conjures up two blind Familiars to fight for Visage. Familiars have high attack power, but each attack drains a charge of damage that recharges slowly over time. Familiars possess the Stone Form ability, that allows them to turn into stone, stunning enemies upon landing. While in Stone Form, Familiars are invulnerable, and rapidly regenerate their health and damage. Familiars grant high bounty when killed.\nUpgraded by Aghanim's Scepter: Increases familiars summoned.\n\n"}],"type":"Intelligence","name":"Visage"}
{"_id":{"$oid":"59402ce1bfa46541761e3b58"},"lore":"Releases the energy stored from the nearest trap.(global)The traps can also be detonated manually. Dota Allstars: The apprentice of a legendary creature from Aiur, Lanaya is a psychic adept who specializes in strategic assassination for the Sentinels. Her psionic abilities manifest in and out of combat, and can be used to amplify damage while attacking, to protect her from enemy assault, or cloak herself invisibly before lashing out at an unfortunate passer-by. And so more often than not, the foes that encounter the Templar on the battlefield find themselves dead and buried, their lives cut short as she fades back into the shadows, waiting for a new prey.Dota 2:Lanaya, the Templar Assassin, came to her calling by a path of curious inquiry. Possessed of a scientific bent, she spent her early years engaged in meticulous study of nature’s laws–peering into grimoires of magic and alchemy, recreating experiments from charred fragments of the Violet Archives, and memorizing observations of the Keen recordkeepers. Already quiet and secretive by nature, the difficulty of acquiring these objects further reinforced her skills of stealth. Had she been less retiring, she might have become notorious among the guilds as a thief-scholar. Instead her investigations led her into far more obscure corners. As she devoted her furtive talents to unlocking the secrets of the universe, she instead unlocked a secret door that exists in nature itself: the entryway to the most Hidden Temple. The intelligences that waited beyond that portal, proved to be expecting her, and whatever mysteries they revealed in the moment of their discovery was nothing compared to the answers they held out to Lanaya should she continue in their service. She swore to protect the mysteries, but more to the point, in service to the Hidden Temple she satisfies her endless craving for understanding. In the eyes of each foe she expunges, a bit more of the mystery is revealed.","skills":[{"name":"Refraction","description":"Manipulating her psionic veil, Templar Assassin becomes highly elusive, evading damage while gaining a bonus to her damage for a limited number of instances. The instances of damage block and bonus damage are separate. Lasts 17 seconds.\n"},{"name":"Meld","description":"Templar Assassin conceals herself, gaining invisibility while remaining still. On the next attacked enemy unit, Lanaya will reduce its armor and deal bonus damage to it.\n"},{"name":"Psi Blades","description":"Templar Assassin's psi blades slice through the attacked unit, splitting and damaging enemy units directly behind it, while gaining bonus attack range.\n"},{"name":"Psionic Trap","description":"Templar Assassin places mystical traps that invisibly monitor enemy movement. When sprung, at her command, they exert a slowing influence of 50% in the area. This trap can be detonated by Templar Assassin from the character or the trap itself.\n"},{"name":"Trap (Proximity)","description":"Springs the closest set trap to Layana, slowing nearby enemies. Note that this range is global.\n"},{"name":"Trap (Target)","description":"Detonates the target trap, slowing nearby enemies.\n"}],"type":"Agility","name":"Templar_Assassin"}
{"_id":{"$oid":"59402ce1bfa46541761e3b59"},"lore":"Dota Allstars:: Goblin engineering was always innovative, but Boush brought it to such extreme that most refuse to believe that his powers lie in machine and rather think that he fights with magic. He can shoot focused light and homing projectiles as powerful and as flashy as most destructive Elven Arcane spells. It is said that not even the best Necromancers can raise armies comparable to seemingly endless amount of clockwork goblins that Boush can easily summon. And while some refuse to believe in his machinery skills and other call him the master artist of engineering, none can deny the destructive force of this goblin. Dota 2: Boush the Tinker's diminutive race is known for its intelligence, its cunning, and its prickly relationship with magic. As a matter of pride, they survive by their wits, and use only those powers of nature that may be unlocked through rational methodologies. Even this forbearance has led to a great deal of trouble, as Boush can attest. Once a key investigator of natural law, Boush the Tinker led a vast intellectual investigation into the workings of nature, founding a subterranean laboratory in the rumored, mist-wreathed wastes of the Violet Plateau. While scorning mages for the dangers they visit upon the world, Boush and his Tinker associates haughtily wrenched open a portal to some realm beyond comprehension and ushered in some nightmares of their own. A black mist rose from the cavernous interior of the Violet Plateau, shrouding it in permanent darkness from which sounds of horror perpetually emanate. Boush escaped with only his wits and the contraptions he carried, the sole Tinker to survive the Violet Plateau Incident.","skills":[],"type":"Intelligence","name":"Tinker"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5a"},"lore":"Target Radius: 275 Damage: 25/35/45/55  Movement Speed Increase: 20/40/60  Dota Allstars: Looming from the rocky crags of Ashenra, the stone giants are born from the mountain itself. Tiny, a newly born giant, although small in size, has the strength of a hill. With his supreme strength, he is able to launch anything into the air, including huge amounts of soil to cause avalanches around his enemies. Because of his craggy exterior, enemies have a hard time attacking him. Over time, Tiny's body will grow bigger as the magnetic forces deep inside his granite heart pull rocks and soil to his rugged stone form. Dota 2: Coming to life as a chunk of stone, Tiny's origins are a mystery on which he continually speculates. He is a Stone Giant now, but what did he used to be? A splinter broken from a Golem's heel? A shard swept from a gargoyle-sculptor's workshop? A fragment of the Oracular Visage of Garthos? A deep curiosity drives him, and he travels the world tirelessly seeking his origins, his parentage, his people. As he roams, he gathers weight and size; the forces that weather lesser rocks, instead cause Tiny to grow and ever grow. Tiny is a strength hero with amazing potential. At first, Tiny is quite squishy, not having much health; he also has a pitiful mana pool (Blink Dagger is amazing on Tiny now, because it no longer uses mana). So, you've reached level 6. You should have a bracer, boots of speed (Which, depending on if somebody else has already bought Arcane Boots, you should build into Tranquil Boots later on), and maybe a bottle (Only if playing mid, especially against mana-burning heroes such as Anti-Mage, or Nyx). You should have helped your team get 1 or 2 kills, or maybe even have gotten them yourself. Now, you upgrade your ultimate. Last hits become a bit harder here, due to the attack speed loss from Grow, but you move faster and gain a damage boost of 50, which scaled up to 150 later on. Also, you grow bigger. You shed your little tiny hill skin and grow into a larger hill. Later on you'll go from your large hill into a small mountain, and then a rocky behemoth. Your mana pool should be enough to sustain a combo or 2 without any more mana gain. Using avalanche followed by toss should mostly finish off a hero. You should have a hyperstone by now, to offset your attack speed loss; build that later into Assault Cuirass to reduce the enemies' armour, and then aim for an Aghanim's Scepter. Now, the Scepter is a very environmentally friendly item, causing Tiny to brandish a tree to smash the other team (The tree does cleave damage and extra damage to buildings, and the Scepter also adds extra percentage of damage to toss. With Aghanim's, a successful combo can do over 1000 damage, and then you can finish them off while they're stunned).His Avalanche is a good stun to initiate, and then toss will usually finish off any escaping heroes in a mid to late-game teamfight. Utilizing Blink Dagger effectively isn't too hard, you simply teleport in front of them and smash them to bits. Tiny's pure mountain-like badassness just makes him an incredibly fun character to play.","skills":[{"name":"Avalanche","description":"Bombards an area with rocks, stunning and damaging enemy land units.\n"},{"name":"Toss","description":"Grabs a random unit in a 250 radius around Tiny, friend or enemy, and launches it at the target unit to deal damage where they land. If the tossed unit is an enemy, it will take an extra 20% damage. Toss does more damage as Tiny's size increases. *Note. If Tiny uses Avalanche then throws the hero that got hit by Avalanche, and the hero lands on the Avalanche before it ends, it will take the toss damage plus Avalanche damage twice, making Tiny's combos incredibly powerful.\n"},{"name":"Craggy Exterior","description":"Causes damage to bounce back on Tiny's attackers. Enemies that attack Tiny from within 300 units have a chance of being stunned for 1.2 seconds.\n"},{"name":"Grow","description":"Tiny gains craggy mass that increases his power at the cost of his attack speed. Increases Tossed unit damage and improves movement speed.\nAghanims: Allows Tiny to equip a tree, which increases his attack range to 235. His attacks also gain 50% cleave in a 400 radius, and deal 75% bonus damage to buildings. \n\n"}],"type":"Strength","name":"Tiny"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5b"},"lore":"","skills":[],"type":"Intelligence","name":"Storm_Spirit"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5c"},"lore":"DOTA 2:Slardar is a Slithereen, one of the Deep Ones, guardian of the great wealth of sunken cities and the ancient riches buried there. In the lightless gulf of the great ocean abysses, the Slithereen Guard carries his lure-light with him through the secret treasure rooms. Subaqueous thieves (sent into the deeps by covetous dryland sorcerers) are drawn in by its friendly glow, never to return. He is utterly loyal, and his taciturn nature hides deep knowledge of the most secret places of the sea. He rises to the shallows in spite of the pain caused him by brightness, to commit reconnaissance, to make sure no one is conspiring against the depths, and sometimes in relentless pursuit of the rare few who manage to steal off with an item from the Sunken Treasury. Because he has spent his whole life at great pressure, under tremendous weight of the sea, Slardar the Slithereen Guard is a creature of great power. Slarder is a powerful DPS chaser and sometimes semi-carry due to his Sprint for movement speed and amplified damage, with a crush and stun for extra damage. However, to be a successful chaser, Slarder requires more Hp to be able to tank the damage caused by towers and creeps. Bracers would be very beneficial to him as it increases his hp and his damage, both of which Slarder needs to fulfill his role. Slarder has a very cheap core build, three bracers, Boots and TP scroll. If you have survivability issues due to casters get a Black King Bar. If you are dominating get a hyperstone. Dagger is also a good option on Slarder because normally if a fragile hero gets Amplify Damage he normally turns and runs the other direction.There are two skill build choices for Slarder. Slithereen Crush is always leveled up first but then the question is to whether level up Sprint or Crush first. The advantages of leveling sprint first is that you dont have to upgrade boots early game also when you get your ulti you can start ganking/roaming straight away. Crush is the more common build because some people argue that Slarder doesn't have enough health to use sprint effectively early game and that when Slarder catches up to his opponent he doesn't have the DPS that Crush gives to be able to kill them before they reach their base. Both options are viable. Amplify damage always is leveled whenever possible.Slarder needs to stay in lane and farm until level 6 when he gets his ulti. Abuse the ultis low cooldown and low manacost and continuously use it on any enemy you see. To kill first Amplify Damage them then either Dagger blink in or walk in and use Slithereen Crush. Then autoattack him until he dies or runs (or you die). If he runs identify if you can kill him before he reaches base, based on experience. IF you think you can kill him turn on sprint and chase him. In teamfights Slarder can initiate if he has dagger but it's not prefered because Slarder isn't as tank as other initiators are. Normally come in after the initiator initiates and then use Black King Bar if you have one and Amplify Damage the enemy Carry or Caster (depending on who you think is more dangerous). Then use Slithereen Crush after your initiater's stun wears off and start whacking your target to death.","skills":[],"type":"Strength","name":"Slardar"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5d"},"lore":"Primary Attribute: Agility Dota 2: Kardel Sharpeye was born deep in the mountainous valleys of Knollen where, since time immemorial, the folk have survived by hunting the strange, cliff-dwelling steepstalkers above their village—killing them from a distance and collecting their carcasses where they fell. Sharpeye was among the best of these strange folk for whom projectile weapons are but another appendage, and to shoot is as natural as to touch. On his day of summoning, when he was to gain full standing in his village, Sharpeye took the ancient test: a single shot from the valley floor to strike a beast down from the cliffs. To miss was to be dishonored. With his entire village standing vigil, Sharpeye took his shot. A steepstalker fell; the crowd cheered. But when the carcass was collected, the village grew silent, for the elders found that the bullet had pierced its glittering central eye then fallen to be clenched in the steepstalker's mandibles. This ominous sign was the literal opening of a dark prophecy, foretelling both greatness and exile for the gunman who made such a shot. Sharpeye the Sniper was thus, by his own skill, condemned to make his way apart from his people—and unwelcome back among them until he has fulfilled the remainder of the prophecy by attaining legendary stature on a field of battle. Dota Allstars: Kardel Sharpeye is a testament to his name and race. Using only his finely honed skills of marksmanship and his trusty rifle, he systematically destroys his opponents from afar. Taking great care to aim for the most vulnerable of areas, he is capable of severely injuring an opponent, and with a little extra time, has been known to simply dispose of an enemy in a single shot. His rifle is equipped with a secondary barrel, capable of launching a short burst of shrapnel at close range, causing massive damage. Mana Cost: 120 Cooldown: 15","skills":[],"type":"Agility","name":"Sniper"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5e"},"lore":"","skills":[{"name":"Land Mines","description":"Plants an invisible mine that explodes when an enemy is near. The explosion deals less damage if the target is farther away.\n"},{"name":"Stasis Trap","description":"Plants an invisible Stasis Trap that stuns nearby enemy units when detonated.\n"},{"name":"Suicide squad, Attack","description":"Sacrifice yourself for the greater good. Deals massive area of effect damage.\n"}],"type":"Intelligence","name":"Goblin_Techies"}
{"_id":{"$oid":"59402ce1bfa46541761e3b5f"},"lore":"Dota Allstars:A follower of the great God of Order, Paladine, Sven has sworn to uphold the rights of all. Born of aKnight and a Night Elf and ostracized since birth, Sven has lead a solitary existence of meditation and training. He has come out of his wanderings determined to guard the innocent against evil. Armed with his blessed cleaving blade Justice, and harnessing the power to strike down his enemies with the might of God's Strength, Sven's wrath toward the unjust is a sight to behold.Dota 2:  Sven is all about getting pumped up. His skills allow him to deal a lot of area of effect damage to several targets at once. Storm Bolt is a powerful damage spell, which stuns both the target and all surrounding units for several seconds, allowing Sven to catch up and deal with them. His Warcry ability helps, giving Sven and nearby allies a temporary movement speed and armor bonus so they can charge quickly and fearlessly. Sven's foes should be especially fearful of his powerful physical attacks. God's Strength pumps Sven's damage up to very high levels, and Cleave turns every attack into an area of effect strike. Although his gameplay is fairly straightforward, Sven should not be underestimated. The best course of action when faced with a fully pumped Sven is to run. A popular Sven build is to start off with a stout shield because Sven has low starting armor for a melee hero. Getting it would increase his EHP during the laning phase. Some tangoes/salves so that he can stay in lane longer in lane and some clarities so that you can use Storm Bolt whenever it is required. Early core items are pretty normal for a roamer like Sven ; Magical Bottle and Magic Wand for the Mana and Rune whoring, Phase Boots and Power Treads are both viable choices. Phase increases his chasing power while Treads boost his damage, as well as his ultimate, and attack speed. Soul Ring can be used to replace the Wand but it requires more gaming experience to be used. It naturally synergises with Sven because his mana problems and his tankiness. Armlet is a great item on Sven because he is has the HP to use it and it greatly increases his damage. Blink Dagger is an optional choice on Sven because he has initiating power with Storm Bolt and he is a melee hero which means that he needs to get up close to be able to deal lots of damage. If Sven has trouble surviving ganks or teamfights get a BKB or a Blademail depending on personal preference and the situation. If he is getting fed he can get most tank items such as Assault Cuirass, Heart of Tarrasque and Satanic. These items increases Sven damage as well as increasing his EHP. NOTE: This item build is not rigid and should be altered depending on the game situation. Theres not too much variation in Sven skillbuilds. Storm Bolt is obviously maxed out first due to being a stun and a nuke. It is taken at levels 1,3,5,7. At level two there is an optional choice between stats and warcry. Stats gives Sven much needed mana and warcry gives Sven a better chance to escape/chase. Stats are taken at level 4 to increase Sven's mana pool again. Warcry is maxed out next at 8,9,10,12 or 2,8,9,10 if you took it early. Cleave is maxed out next because it scales with the late game. Ultimate: God's Strength is taken whenever possible (6,11,16). Stats are taken for the rest.","skills":[{"name":"Storm Hammer","description":"The Rogue Knight's iron gauntlet, taken from the school of his father, strikes his foes to their core.\nSven unleashes his magical gauntlet on target area or enemy unit, dealing damage and stunning enemy units caught in the blast.\n\n"},{"name":"Great Cleave","description":"The Vigil Knights still seek to reclaim the stolen Outcast Blade from Sven, a weapon capable of cutting wide swaths through lesser warriors.\nSven strikes with great force, cleaving all nearby enemy units with his attack.\n\n"},{"name":"Warcry","description":"Calling a few lines from the Vigil Codex fortifies Sven's obedience to his rogue code.\nSven's Warcry heartens his allies for battle, increasing their movement speed and armor. Lasts 8 seconds.\n\n"},{"name":"God's Strength","description":"With the strength that shattered the Sacred Helm, the Rogue Knight stands unopposed in melee combat. \nSven channels his rogue strength, granting bonus damage for 25 seconds.\n\n"}],"type":"Strength","name":"Sven"}
{"_id":{"$oid":"59402ce2bfa46541761e3b60"},"lore":"Dota Allstars:An outcast of the Spirithoof clan, Barathrum retreated in shame to the Ethereal Plane, feeding off wandering souls to sustain himself, and wandered aimlessly for centuries, alone and miserable. Found and recruited by the Lich King, Barathrum's uncanny speed and wraithlike powers have now been unleashed upon the Material Plane, his lantern able to project nether energy into enemies, sending them backwards with sudden force. With the ability to close the distance between himself and a target in seconds, Barathrum the Spiritbreaker is more than a match for anyone.Dota 2:Barathrum the Spirit Breaker is a lordly and powerful being, a fierce and elemental intelligence which chose to plane-shift into the world of matter to take part in events with repercussions in the elemental realm that is his home. To that end, he assembled a form that would serve him well, both in our world and out of it. His physical form borrows from the strengths of this world, blending features both bovine and simian—horns, hooves and hands—as outward emblems of his inner qualities of strength, speed and cunning. He wears a ring in his nose, as a reminder that he serves a hidden master, and that this world in which he works is but a shadow of the real one.","skills":[{"name":"Charge of Darkness","description":"Breaker fixes his sight on an enemy unit and starts charging through all objects. All enemy units passed through will be hit by a Greater Bash, and the targeted unit is stunned upon impact. If the targeted unit dies, Spirit Breaker will change his target to the nearest enemy unit to that location.\n"},{"name":"Empowering Haste","description":"Causes the Spirit Breaker to gain power with higher movement speed, allowing him to deal extra damage based on his movement speed. His presence increases the movement speed of nearby allied units.\n"},{"name":"Greater Bash","description":"Gives a chance to stun and knockback an enemy unit on an attack, as well as gaining bonus movement speed after a bash occurs.\n"},{"name":"Nether Strike","description":"Spirit Breaker slips into the nether realm, reappearing next to his hapless victim. Upon reappearing, a Greater Bash occurs and deals bonus damage.\nUpgraded by Aghanim's Scepter: Increased range and applies level 4 Greater Bash in a 250 radius upon Spirit Breaker's arrival.\n\n"}],"type":"Strength","name":"Spirit_Breaker"}
{"_id":{"$oid":"59402ce2bfa46541761e3b61"},"lore":"More information needed... Dota Allstars: A darkness who was ancient even in the early days of the world's existence, Mercurial is the embodiment of rage and vengeance in the souls of those long dead. Haunting her enemies with relentless fervor, she is able to throw a dagger-like projectile that allows her to chase her prey beyond physical boundaries, and the fear and the desolation struck in the hearts of those who have the misfortune of encountering her alone is a pain impossible to withstand. Spectre's thirst for destruction is insatiable, and the upcoming struggle seems to be just what she was waiting for. Dota 2:Just as higher states of energy seek a lower level, the Spectre known as Mercurial is a being of intense and violent energy who finds herself irresistibly drawn to scenes of strife as they unfold in the physical world. While her normal spectral state transcends sensory limitations, each time she takes on a physical manifestation, she is stricken by a loss of self--though not of purpose. In the clash of combat, her identity shatters and reconfigures, and she begins to regain awareness. She grasps that she is Mercurial the Spectre--and that all of her Haunts are but shadows of the one true Spectre. Focus comes in the struggle for survival; her true mind reasserts itself; until in the final moments of victory or defeat, she transcends matter and is restored once more to her eternal form. Spectre is complex melee fighter with a unique series of special attack skills. She's able to Desolate opponents for pure damage if she catches them alone. She can also Disperse incoming damage, deflecting it into the area around her. She can hurl a Spectral Dagger at opponents, slowing and damaging enemies while at the same time allowing her to pass through material objects and travel across any terrain. Her ultimate weapon though, and the thing that sets her apart from all others, is her Haunt ability. She should be feared as a constant presence, being able to Haunt all enemy heroes on the battlefield at once, appearing out of nowhere to harass and confuse an entire enemy force, no matter where they are on the map. Haunt is a great strategy tool, as she can then take over one of her phantom images to physically enter a fight at the location that give her best advantage.","skills":[{"name":"Spectral Dagger","description":"Spectre flings a dagger to draw a Shadow Path, dealing damage and slowing any enemies along the trail. Units hit by the dagger also trail a Shadow Path. While treading the path, Spectre phases through otherwise impassable terrain.\n"},{"name":"Desolate","description":"Deals bonus pure damage when Spectre attacks an enemy hero with no nearby allied units.\n"},{"name":"Dispersion","description":"Damage done to Spectre is reflected on her enemies, leaving her unharmed. The effect lessens with distance.\n"},{"name":"Haunt","description":"Creates a spectral nemesis to attack each enemy hero after a short delay. Haunts are uncontrollable, take extra damage, and deal less damage than Spectre herself. At any moment during the duration, Spectre can use Reality to take the place of a given illusion.\n"},{"name":"Reality","description":"Spectre physically possesses a chosen Haunt, giving it solid reality while the other images blink out of existence.\n"}],"type":"Agility","name":"Spectre"}
{"_id":{"$oid":"59402ce2bfa46541761e3b62"},"lore":"Further information needed... DOTA 2:","skills":[{"name":"Disruption","description":"Banishes the targeted unit, removing it from battle for the duration, granting untargetability and invunerability at the cost of all actions. Upon returning, two illusions of the unit are created under Shadow Demon's control.\n"},{"name":"Soul Catcher","description":"Curses a random enemy in an area to take increased damage. The bonus damage is dealt as a separate instance of damage. Units under the effect of Disruption can still be affected by Soul Catcher.\n"},{"name":"Shadow Poison","description":"Deals damage in a line, and afflicts enemy units with a poison effect. The poison deals 1/2/4/8 times the stack damage based on the number of stacks on the target, up to 4 stacks. Additional stacks cause 50 damage each. This deferred damage is dealt when Shadow Poison's duration is expired, or the Release sub-ability is used. Units under the effect of Disruption can still be affected by Shadow Poison.\n"},{"name":"Shadow Poison Release","description":"\n"},{"name":"Demonic Purge","description":"Purges the target enemy unit, removing positive buffs and slowing it for the duration of the spell. The unit slowly regains its speed until the end of the duration, at which which it is damaged. Units under the effect of Disruption can still be affected by Demonic Purge.\n"}],"type":"Intelligence","name":"Shadow_Demon"}
{"_id":{"$oid":"59402ce2bfa46541761e3b63"},"lore":"Shadow Fiend's only defence lies in his superb offence. After every life he takes, he traps their soul to empower his attack damage with Necromastery. This allows him to amass high attack damage. His ultimate, Requiem of Souls, can summon these souls to inflict great damage on those enemies foolish enough to venture within reach. His unique Shadowraze allows him to blast opponents in small areas, at three separate distances. Another ability, Presence of the Dark Lord, makes enemies more vulnerable to physical damage, passively reducing their armour. Deadly from a number of distances, but vulnerable if caught off guard, Shadow Fiend's positioning in battle is of utmost importance. Dota Allstars:A demon of the burning legion so abhorred that he makes the skin of even hisfellow demons crawl, Nevermore is a creature of shadows that consumes thesouls of those surround him.When the Shadow Fiend comes forth to battle, he augments his power with the souls he has consumed, bearing down on his enemies with spiritually enhanced attacks and powerful spiritual blast.​The Shadow Fiend is​a terrifying opponent whom few have survived, and those who have perish histyranny have face the despicable fate of all.DOTA 2:It is said that Shadow Fiend has the soul of a poet, and in fact he has thousands of them. Over the ages he has claimed the souls of poets, priests, emperors, beggars, slaves, philosophers, criminals and (naturally) heroes; no sort of soul escapes him. What he does with them is unknown. No one has ever peered into the Abysm whence Shadow Fiend reaches out like an eel from among astral rocks. Does he devour them one after another? Does he mount them along the halls of an eldritch temple, or pickle the souls in necromantic brine? Is he merely a puppet, pushed through the dimensional rift by a demonic puppeteer? Such is his evil, so intense his aura of darkness, that no rational mind may penetrate it. Of course, if you really want to know where the stolen souls go, there's one sure way to find out: Add your soul to his collection. Or just wait for Nevermore.","skills":[],"type":"Agility","name":"Shadow_Fiend"}
{"_id":{"$oid":"59402ce2bfa46541761e3b64"},"lore":"More information needed... Dota 2:Any mage can cast a spell or two, and a few may even study long enough to become a wizard, but only the most talented are allowed to be recognized as a Magus. Yet as with any sorcerer’s circle, a sense of community has never guaranteed competitive courtesy.","skills":[{"name":"Telekinesis","description":"Rubick uses his telekinetic powers to lift the enemy into the air briefly and then hurls them back at the ground. The unit lands on the ground with such force that it stuns nearby enemies.\n"},{"name":"Telekinesis Land","description":"Chooses the location the target will land when Telekinesis finishes.\n"},{"name":"Fade Bolt","description":"Rubick creates a powerful stream of arcane energy that travels between enemy units, dealing damage and reducing their attack damage. Each jump deals less damage.\n"},{"name":"Null Field","description":"Rubick's mastery of the arcane protects allied heroes against weaker magics, granting them magic resistance.\n"},{"name":"Spell Steal","description":"Rubick studies the trace magical essence of one enemy hero, learning the secrets of the last spell the hero cast. Rubick can use this spell as his own for several minutes or until he dies.\n"}],"type":"Intelligence","name":"Rubick"}
{"_id":{"$oid":"59402ce2bfa46541761e3b65"},"lore":"Dota Allstars Hailing from the magical community of Quel'Thalas, Nortrom is one of the strongest Elven warriors defending the integrity of the lands. Mastering the ancient art of glaive-throwing, and combining it with the volatile nature of the Blood Elves' arcane magic, he is able to disrupt the magical energies in his enemies. By binding his magical powers to his glaive, he is able to cause damage beyond devastation, gaining intelligence from every kill. Concentrating all his energies, he can cause chaos within his enemies' magical pools, making them unable to cast spells. He is determined to fend off the Scourge and their demon magic until he has breathed his last. Dota 2: Part of the seventh and final generation of a carefully designed pedigree, Nortrom was bred by the ancient order of the Aeol Drias to be the greatest magic user the world had ever seen. He was the prophesied one, the culmination of two-hundred years of careful pairings, a war-mage who would bring glory to the order, and destruction to their sworn enemies, The Knights of the Fold. Raised with other young mages in a hidden cantonment among the hills of the Hazhadal barrens, the order's preceptors waited for Nortrom’s abilities to manifest. While the other students honed their talents with fire, or ice, or incantatory spells, Nortrom sat silent and talentless, unable to cast so much as a hex. As the day of final testing approached, he still hadn’t found his magic. In disgust, the preceptors berated him, while the children laughed. “You are no mage,” the head of the order declared. Still, Nortrom did not slink away. He entered the day of testing and faced down the young mages who had mocked him. And then his preceptors learned a valuable lesson: a lack of magic can be the greatest magic of all. Nortrom silenced the young mages one by one and defeated them in single combat, until he alone stood as champion of the Aeol Drias, in fulfillment of the prophecy.","skills":[{"name":"Curse of the Silent","description":"Curses the target area, causing enemy units to take damage and lose mana until they cast a spell.\n"},{"name":"Glaives of Wisdom","description":"Silencer enchants his glaives with his wisdom, dealing additional damage based on his Intelligence.\nGlaives of Wisdom is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers.\n\n"},{"name":"Last Word","description":"Enemy heroes nearby will be silenced whenever they cast a spell. If an enemy hero dies while in range of Last Word, Silencer will permanently steal 1 Intelligence from that hero. If Silencer is the killer, he will steal 2 Intelligence.\n"},{"name":"Global Silence","description":"Silencer stops all sound, preventing enemy heroes and units on the map from casting spells.\n"}],"type":"Intelligence","name":"Silencer"}
{"_id":{"$oid":"59402ce2bfa46541761e3b66"},"lore":"More information needed... Dota Allstars: Once a gifted troll witch doctor, young Rhasta was well versed with the secrets of voodoo magic. When the war between the Sentinel and the Scourge began, Rhasta, then a Shadow Hunter, offered his allegiance to the Sentinels to vanquish the Scourge once and for all. While he was gifted as a witch doctor, Rhasta is a genius as a shadow hunter, exceeding his master by mastering the art of summoning multiple serpent wards, binding enemies for a short time and casting elemental lightning to several units. Dota 2:Born in the Bleeding Hills, Rhasta was just a starving youngling when picked up by a travelling con-man. For two pins of copper, the old con-man would tell your fortune. For three, he’d castrate your pig, for five, he’d circumcise your sons. For a good meal, he’d don his shaman garb, read from his ancient books, and lay a curse upon your enemies. His strange new youngling, part hill trowle, part…something else, worked as assistant and lent an air of the exotic to the con-man’s trade.Always one step ahead of cheated customers, one town ahead of a pursuing patronage, the two trekked across the blighted lands until one day the con-man realized that the little youngling could actually do what he only pretended at. His ward had a gift—a gift that customers valued. And so the youngling Rhasta was thrust before the crowds, and the trade-name Shadow Shaman was born. The two continued from town to town, conjuring for money as Shadow Shaman’s reputation grew. Eventually, the pair’s duplicitous past caught up with them, and they were ambushed by a mob of swindled ex-clients. The con-man was slain, and for the first time, Rhasta used his powers for darkness, massacring the attackers. He buried his beloved master, and now uses his powers to destroy any who would seek to do him harm. Shadow Shaman is one of the best heroes for disabling enemies, with two strong spells of this type. However, he is a fragile hero who tends to become a focus for enemy wrath in combat. Teamwork and communication are essential if Shadow Shaman is to make full use of his potent spell arsenal. Ether Shock is a useful ability, good for harassing foes, killing creeps, and finishing off wounded enemies who try to escape his snares. Hex is a straightforward polymorph skill, transforming the target into a critter and rendering them useless in a fight for a few seconds. Shackles is an interesting ability which disables the target and also Shadow Shaman, who must remain immobile while he channels the spell. However, this is not as much of a disadvantage as it might seem, since his Mass Serpent Ward gives him a powerful means of destroying his target while he holds them in place. The wards are a powerful siege tool as well, able to level buildings very quickly. Since towers can only defend against one ward at a time, they stand little chance against Shadow Shaman's legion of serpents.","skills":[{"name":"Ether Shock","description":"Creates a cone of ethereal energy that strikes multiple enemy units.\n"},{"name":"Hex","description":"Transforms an enemy unit into a harmless creature for a short time, disabling their attacks and abilities.\n"},{"name":"Shackles","description":"Channeled: Magically binds an enemy unit so that it cannot move or attack, while dealing damage over time.\n"},{"name":"Mass Serpent Ward","description":"Summons 8 serpent wards in a ring to attack enemy units and structures. The wards are immune to magic, and have a small area of splash damage that increases per level.\nUpgraded by Aghanim's Scepter:: Increases ward damage.\n\n"}],"type":"Intelligence","name":"Shadow_Shaman"}
{"_id":{"$oid":"59402ce2bfa46541761e3b67"},"lore":"DOTA Allstars:","skills":[],"type":"Intelligence","name":"Queen_of_Pain"}
{"_id":{"$oid":"59402ce2bfa46541761e3b68"},"lore":"Dota Allstars: A guardian of the ancient Nerubian Kingdom of Azjol-Nerub, Crixalis fled to the deserts of Kalimdor in an attempt to escape the genocide of the Lich King. The harsh climate transformed this warrior into a master of the earth, able to tear the skin off his foes with vicious sand storms. Those unfortunate to succumb to his potent toxins are condemned to violently burst apart in a cloud of noxious fumes. Sensing his growing power, the Lich King sought out Crixalis and unable to sway him, slew him in battle. Summoned to aid the Undead Scourge, the heart of the Sentinel quivers each time the ground trembles beneath them. ","skills":[{"name":"Burrowstrike","description":"Sand King burrows into the ground and tunnels forward, damaging and stunning enemy units above him as he resurfaces.\n"},{"name":"Sand Storm","description":"CHANNELED - Sand King creates a fearsome sandstorm that damages enemy units while hiding him from vision. The invisibility remains for a short duration after the sandstorm ends.\n"},{"name":"Caustic Finale","description":"Sand King's attacks inject a venom that causes enemy units to explode violently upon death, spreading area damage.\nCaustic Finale is a unique attack modifier, and does not stack with other unique attack modifiers. \n\n"},{"name":"Epicenter","description":"Channeled: After channeling for 2 seconds, Sand King sends a disturbance into the earth, causing it to shudder violently. All enemies caught within range will take damage and become slowed. Each subsequent pulse increases the radius of damage dealt.\n"}],"type":"Strength","name":"Sand_King"}
{"_id":{"$oid":"59402ce2bfa46541761e3b69"},"lore":"DOTA 2:Among the emblematic powers that populate the Underscape, Razor the Lightning Revenant is one of the most feared. With his whip of lightning, he patrols the Narrow Maze, that treacherous webwork of passages by which the souls of the dead are sorted according to their own innate intelligence, cunning and persistence. Drifting above the Maze, Razor looks down on the baffled souls below, and delivers jolts of scalding electricity that both punish and quicken the souls as they decide their own fates, hurrying on toward luminous exits or endlessly dark pits. Razor is the eternal embodiment of a dominating power, abstract and almost clinical in his application of power. Yet he has a lordly air that suggests he takes a sardonic satisfaction in his work. Razor is a hero with a wide variety of lightning-based attacks. Although somewhat fragile at the start of the battle, he can nonetheless be used effectively to push lanes and can be vitally important in team fights. His Static Link completes the circuit between himself and an enemy, stealing damage from the target and adding it to his own. His passive Unstable Current increases movement speed and deflects damage back at attackers. His ultimate weapon, Eye of the Storm, calls down the power of the storm upon his enemies, creating an area of effect in which lighting strikes randomly down on the heads of his foes. Razor's most eye-catching ability though is also usually the first one he earns: Plasma Field. A great tool for intimidation and controlling the lanes, this ability expels a powerful ring of excited plasma that expands to envelope all units around Razor, dealing damage to enemy creeps and heroes alike.","skills":[],"type":"Agility","name":"Razor"}
{"_id":{"$oid":"59402ce2bfa46541761e3b6a"},"lore":"More information required... Dota 2:","skills":[{"name":"Nether Blast","description":"An exploding pulse deals damage to enemies and structures in the area. Deals half damage to structures. The Arts of Oblivion include a deafening blast of emerald flames from the Nether Reaches.\n"},{"name":"Decrepify","description":"A powerful banishing spell that slows a unit and renders it unable to attack or be attacked. Afflicted units take extra magic damage. A now-mastered relic from his childhood, Pugna delights in banishing others into the Nether Realm, whether for good, evil, or simple enjoyment.\n"},{"name":"Nether Ward","description":"Pugna places a nether ward that fires mana flares at enemy heroes who dare to cast spells, while also causing them to lose mana. Nether Ward deals damage equal to the damage multiplier times the mana spent by the enemy hero. Lasts 30 seconds. While at the lamasery for the Arts of Oblivion, Pugna learned to dominate his classmates with a simple ward charged with Nether magic.\n"},{"name":"Life Drain","description":"Channeled – When cast on an enemy, Pugna drains health from the target enemy unit to heal himself. If Pugna has full HP, and the enemy target is a Hero, Life Drain will restore mana instead. When cast on an ally, Pugna will drain his own health into his ally.\nUpgraded by Aghanim's Scepter: Increases drain per second and sets cooldown time to zero.* Pugna has truly become more powerful than even the grandmaster of Oblivion.\n\n"}],"type":"Intelligence","name":"Pugna"}
{"_id":{"$oid":"59402ce3bfa46541761e3b6b"},"lore":"Dota Allstars:In Sentinel's search for heroes to aid them in the war against the Scourge, they discovered the lost lands of the mystical Faerie Dragons. Upon explaining the conflict to the Faerie Queen of Agrace, she sent forth Puck, a personal guardian, to turn the tides of war. Despite his small size and mischievous personality, the little dragon soon proved to pack more than his fair share of power on the battlefield, blasting through the enemy ranks with balls of magic, faerie dust, and the capability to stupefy an entire army with nothing more than his imagination. His foes all learned the hard way that size matters not in combat, and that appearances are, ultimately, deceiving. Dota 2: Puck is one of the best heroes for starting fights, favouring aggressive play styles. Puck's highly flexible skill set is useful in any situation, making him a great hero in both support and offensive roles. Illusory Orb functions like a regular line damage spell--yet at any point along its course, Puck can use Ethereal Jaunt to instantly teleport to Illusory Orb's position. This makes the spell useful for both attacking and escaping. It also meshes perfectly with Puck's offensive spell, Waning Rift. Waning Rift deals damage and silence in an area around Puck, making it the natural choice for use after an Illusory Orb and Ethereal Jaunt. Puck's final offensive spell, Dream Coil, can be used either before or after this combo with great effect. Trapping enemies in a small area, Dream Coil forces them to remain near the target point or take damage and get stunned. Phase Shift, meanwhile, renders Puck invulnerable for several seconds--a highly useful skill on the frequent occasions when Puck ends up right in the middle of the fray. Puck is a relatively easy hero to pick up, and a highly rewarding one to master.","skills":[{"name":"Illusory Orb","description":"Puck launches a magic orb that floats in a straight path, damaging enemy units along the way. At any point, Puck may teleport to the orb's location using Ethereal Jaunt. The playful Faerie Dragon delights in confusing others, vanishing and reappearing where unexpected.\n"},{"name":"Ethereal Jaunt","description":"Teleports Puck to a flying Illusory Orb.\n"},{"name":"Waning Rift","description":"Puck releases a burst of faerie dust that deals damage and silences enemy units nearby. With a mischievous grin, Puck spreads its enchanted powder which disrupts magical flow.\n"},{"name":"Phase Shift","description":"Puck briefly shifts into another dimension where it is immune from harm. With a quip and flash, Puck returns to the alien dimension from whence it came.\n"},{"name":"Dream Coil","description":"Creates a coil of volatile magic that latches onto enemy Heroes, stunning them for 0.5 seconds and damaging them. If the enemy hero stretches the coil by moving too far away, it snaps, stunning and dealing additional damage. Increases coil duration, coil-break damage and coil-break stun duration. Makes Coil-break stun pierce spell immunity*. The Faerie Dragon sows confusion by forcing its enemies to vividly dream about their own mortality.\n"}],"type":"Intelligence","name":"Puck"}
{"_id":{"$oid":"59402ce3bfa46541761e3b6c"},"lore":"Dota Allstars:Although his true name is unknown to his allies, Azwraith's assigned name tells you enough. Like the Angel of Death, Azrael, he fights to rid the world of those who choose to embrace undeath. He is able to appear and disappear at will like a wraith, often appearing in many places at once. Azwraith is more than capable of dispatching the undead using his lance, each blow sending them closer to the spirit-realm. This lance is the source of his astounding ability to duplicate himself; whenever it draws blood he can use their life to create weaker copies of himself. Dota 2:The remote village of Pole had no knowledge of the wars raging in the heart of the kingdom. For them, the quiet of spear fishing, and a family meal were all that a full life required. Yet war came for them nonetheless. Joining the able-bodied conscripts as they filed past their homes, the humble lancer Azwraith vowed to bring peace to his kingdom, and in so doing, his people. Placed with his kin in the vanguard of the final assault against the Dread Magus Vorn, the cost to his fellows was absolute. As the charging force battled toward the fortress, Azwraith alone among his kind remained standing, and he alone was able to infiltrate the keep. Focused and infuriated by the slaughter of his brothers, Azwraith bested each of the wizard's deadly traps and conjured guardians. Soon the simple fisherman arrived at Vorn's tower sanctum. The pair dueled through the night, pike to staff, as chaos raged below, and with a deafening cry Azwraith pierced his enemy. But the wizard did not simply expire; he exploded into uncountable shards of light, penetrating his killer with power. As the dust settled and the smoke of combat began to clear, Azwraith found himself standing among a throng of his kin. Each seemed to be dressed as he was, each seemed armed as he was, and he could sense that each thought as he did. Aware that his allies were approaching, he willed these phantoms to hide themselves, and one by one they began to vanish into nothingness. As the soldiers came upon the sanctum, they found the warrior that had bested the wizard. When they approached their champion, the lancer vanished. The pikeman who had stood before them was no more than another phantom. The real Azwraith had fled the field, ashamed of his anger, heartbroken at his loss, and all the more determined to ensure peace for his people through the wars to come.","skills":[{"name":"Spirit Lance","description":"Casts a magical spirit lance on a target enemy unit, damaging and slowing it, as well as summoning a Phantom to attack the unit.\n"},{"name":"Doppelwalk","description":"Renders Phantom Lancer invisible, while generating a duplicate image to confuse enemies. The image is a Phantom, and automatically moves in a random direction.\n"},{"name":"Juxtapose","description":"Phantom Lancer's attacks have a chance to create illusions upon hit, which can attack and move, but not use skills.\n"},{"name":"Phantom Edge","description":"Phantom Lancer hones his abilities. Improves chance of Juxtaposing, and the Juxtapose illusions can now create their own illusions. Phantom Edge also increases Phantom Lancer's magic resistance.\n"}],"type":"Agility","name":"Phantom_Lancer"}
{"_id":{"$oid":"59402ce3bfa46541761e3b6d"},"lore":"More information needed... Dota 2:“Through a process of divination, children are selected for upbringing by the Sisters of the Veil, an order that considers assassination a sacred part of the natural order.The Veiled Sisters identify targets through meditation and oracular utterances.They accept no contracts, and never seem to pursue targets for political or mercenary reasons. Their killings bear no relation to any recognizable agenda, and can seem to be completely random:A figure of great power is no more likely to be eliminated than a peasant or a well digger. Whatever pattern the killings may contain, it is known only to them. They treat their victims as sacrifices, and death at their hand is considered an honor. Raised with no identity except that of their order, any Phantom Assassin can take the place of any other; their number is not known. Perhaps there are many, perhaps there are few. Nothing is known of what lies under the Phantom Veil. Except that this one, from time to time, when none are near enough to hear, is known to stir her veils with the forbidden whisper of her own name: Mortred.”","skills":[{"name":"Stifling Dagger","description":"Deals minor pure damage and slows the enemy unit's movement speed. Deals half damage to heroes. The first skill learned by the Sisters of the Veil often signals an incoming hit.\n"},{"name":"Phantom Strike","description":"Teleports to a unit, friendly or enemy, and grants bonus attack speed while attacking if it's an enemy unit. Mortred's silken veil is the last thing her unfortunate target sees.\n"},{"name":"Blur","description":"Phantom Assassin focuses inward, increasing her ability to evade enemy attacks, and allowing her to blur her body to disappear from the enemy team's minimap when far from enemy heroes. Meditation allows a Veiled Sister to carefully anticipate her opponents in combat.\n"},{"name":"Coup de Grace","description":"Phantom Assassin refines her combat abilities, gaining a chance of delivering a devastating critical strike to enemy units. Stifling Dagger shares the same critical strike chance. A divine strike, Mortred honors her opponent by choosing them for death.\n"}],"type":"Agility","name":"Phantom_Assassin"}
{"_id":{"$oid":"59402ce3bfa46541761e3b6e"},"lore":"More information needed. Dota 2:One of a lordly and magisterial race, Harbinger prowls the edge of the Void, sole surviving sentry of an outpost on the world at the rim of the abyss. From this jagged crystalline Outworld, forever on guard, he has gazed for eternities into the heavens, alert for any stirring in the bottomless night beyond the stars. Imprinted deep in the shining lattices of his intellect lies a resonant pattern akin to prophecy, a dark music implying that eventually some evil will wake out there, beyond the edges of creation, and turn its attention to our world. With his whole being focused on his vigil, Outworld Destroyer paid little attention to events closer in to the sun. But at last the clamor of the Ancients, and a sense of growing threat from within as well as without, sent him winging sunward to visit the plains of war. Harbinger's place in our own prophecies is unambiguous: he must be considered an omen of worse things to come. But his arrival in itself is bad enough.","skills":[{"name":"Arcane Orb","description":"Adds extra pure damage to Outworld Devourer's attacks, based on his remaining mana pool. Arcane Orb also does bonus damage to summoned units and illusions. Harbinger's outworldly knowledge allows it to tap into the ebb and flow of all spiritual energy, infusing it into his being.\n"},{"name":"Astral Imprisonment","description":"Places a target allied or enemy hero into an astral prison. The hidden hero is invulnerable and disabled. When cast on an enemy Hero, Harbinger temporarily steals intelligence from that hero. Locked away in the pocket between this world and the Outworld, victims realize their infantile knowledge and mortality.\n"},{"name":"Essence Aura","description":"Whenever nearby allied Heroes or Outworld Devourer itself casts a spell, it gains a chance to restore a percentage of its mana pool. Outworld Devourer also passively gains a bonus to its base mana pool. Several skills with no cooldown and toggled spells cannot trigger Essence Aura. The crystals of the Outworld produce arcane power, and the Harbinger channels it into the world of mortals.\n"},{"name":"Sanity's Eclipse","description":"Unleashes a psychic blast that damages enemy heroes based on the difference between the affected hero's Intelligence and Outworld Devourer's. If the difference in intelligence is less than the threshold, the affected hero will lose 75% of their current mana. Should an enemy hero have the same or higher Intelligence than Outworld Devourer, Sanity's Eclipse will have no effect. Sanity's Eclipse can hit units trapped by Astral Imprisonment. Upgraded by Aghanim's Scepter: Increases casting range and affects everyone in the area of effect with Astral Imprisonment after it deals its damage*. When an Outworld crystal ruptures, cataclysmic energies are released, and the reverberations of this power are felt interdimensionally.\n"}],"type":"Intelligence","name":"Outworld_Devourer"}
{"_id":{"$oid":"59402ce3bfa46541761e3b6f"},"lore":"Level 2 - Deals 180 damage and drags the victim to the Butcher. Level 2 - 60 damage per second. Level 2 - Gives Pudge 8% extra resistance to spells. +1.5 STR for hero kills.or enemy heroes that die in a 550 radius Level 2 - 125 damage/second, 125 + 0.75x strength damage per second with Aghanim's Scepter. Dota 2:In the Fields of Endless Carnage, far to the south of Quoidge, a corpulent figure works tirelessly through the night-dismembering, disembowelling, piling up the limbs and viscera of the fallen that the battlefield might be clear by dawn. In this cursed realm, nothing can decay or decompose; no corpse may ever return to the earth from which it sprang, no matter how deep you dig the grave. Flocked by carrion birds who need him to cut their meals into beak-sized chunks, Pudge the Butcher hones his skills with blades that grow sharper the longer he uses them. Swish, swish, thunk. Flesh falls from the bone; tendons and ligaments part like wet paper. And while he always had a taste for the butchery, over the ages, Pudge has developed a taste for its byproduct as well. Starting with a gobbet of muscle here, a sip of blood there...before long he was thrusting his jaws deep into the toughest of torsos, like a dog gnawing at rags. Even those who are beyond fearing the Reaper, fear the Butcher. Pudge is one of the most difficult heroes to play well, but also one of the most rewarding. His Meat Hook skill is extremely deadly but difficult to master. A well placed Meat Hook will snag an enemy hero and drag them to Pudge, dealing damage along the way. Once the target has been hooked, Pudge can use his other two active skills to finish them off: Rot is a toggled Damage Over Time skill which affects all nearby enemies but also Pudge himself. (Pudge must be careful when using Rot, which can quickly drain his life and make him easy prey for enemies.) To stop his target from escaping or resisting, Pudge can use Dismember-a short-range skill that deals damage over time and completely immobilizes the target. When used in succession, these three skills make Pudge a dangerous opponent, although he may not look like much of a threat. To complement his risky maneuvers, Pudge enjoys a passive skill called Flesh Heap. Flesh Heap provides magic resistance, which reduces the damage he takes from Rot, and adds a minor but permanent bonus to his strength every time he kills a unit.","skills":[{"name":"Meat Hook","description":"Launches a bloody hook toward a unit or location. The hook will snag the first unit it encounters, dragging the unit back to Pudge and dealing damage if it is an enemy. The Butcher's hook is a symbolic nightmare, its curved blade a frightening reminder of his slaughterous intent.\n"},{"name":"Rot","description":"A toxic cloud that deals intense damage and slows movement--harming not only enemy units but Pudge himself. A foul odor precedes a toxic, choking gas, emanating from the Butcher's putrid, ever-swelling mass.\n"},{"name":"Flesh Heap","description":"Gives Pudge resistance to magic damage, as well as bonus strength that increases each time Pudge kills an enemy Hero or it dies in his vicinity. Flesh Heap is retroactive, meaning it can gain charges before it is leveled, which then become active. The Butcher gives new meaning to the words ‘meat shield.’\n"},{"name":"Dismember","description":"CHANNELED – Pudge chows down on an enemy unit, disabling it and dealing damage over time. Lasts 3 seconds on Heroes, 6 seconds on creeps. Upgraded by Aghanim's Scepter: Adds a strength-based damage bonus, and heals Pudge equal to the damage dealt by Dismember. ‘When I'm through with these vermin, they'll be fit for a pie!’\n"}],"type":"Strength","name":"Pudge"}
{"_id":{"$oid":"59402ce3bfa46541761e3b70"},"lore":"Dota Allstars:","skills":[],"type":"Strength","name":"Omniknight"}
{"_id":{"$oid":"59402ce3bfa46541761e3b71"},"lore":"More information needed... DOTA Allstars: Ogres, a race bred to be warriors, have no experience with the arcane arts, leaving Aggron, who was born with a rare affinity to magic, without guidance regarding his innate abilities. His own force of will harnesses his talent to produce elemental flames and explosions that consume his opponents. Being a natural warrior, he reaches into his own aggression to fuel his comrades' lust for battle. His savage, untapped magical potential is prone to fiery outbursts which enhance the potency of his spells. A towering force built on strength and magic, Aggron is honored by his people and feared by his enemies.DOTA 2:The ordinary ogre is the creature for whom the phrase 'As dumb as a bag of rock hammers' was coined. In his natural state, an ogre is supremely incapable of doing or deciding anything. Clothed in dirt, he sometimes finds himself accidentally draped in animal skins after eating lanekill. Not an especially social creature, he is most often found affectionately consorting with the boulders or tree-stumps he has mistaken for kin (a factor that may explain the ogre's low rate of reproduction). However, once every generation or so, the ogre race is blessed with the birth of a two-headed Ogre Magi, who is immediately given the traditional name of Aggron Stonebreak, the name of the first and perhaps only wise ogre in their line's history. With two heads, Ogre Magi finds it possible to function at a level most other creatures manage with one. And while the Ogre Magi will win no debates (even with itself), it is graced with a divine quality known as Dumb Luck--a propensity for serendipitous strokes of fortune which have allowed the ogre race to flourish in spite of enemies, harsh weather, and an inability to feed itself. It's as if the Goddess of Luck, filled with pity for the sadly inept species, has taken Ogre Magi under her wing. And who could blame her? Poor things.","skills":[],"type":"Intelligence","name":"Ogre_Magi"}
{"_id":{"$oid":"59402ce3bfa46541761e3b72"},"lore":"Night Stalker's passive Hunter in the Night increases his movement and attack speed at night, making him a feared ganker and chaser whenever the sun is down. His Void spell damages a target and slows them to a crawl, allowing Night Stalker and his allies to deal great amounts of damage. Crippling Fear is a powerful weapon against spellcasters and fighters alike, as it both silences enemies and increases the chance that their physical attacks will miss the target. It is said that you have little to fear from Night Stalker when the sun is high-however, his ultimate ability, Darkness, allows him to instantly turn day into night (or prolong the night that has already fallen), giving his other spells their fullest effect. DOTA Allstars:","skills":[{"name":"Void","description":"Creates a damaging void that slows an enemy unit and deals damage. Void also mini-stuns, interrupting channeling abilities. The slowing effect lasts longer at night. Balanar creates a vortex of infinite night, tearing opponents violently into the eternal darkness that once was.\n"},{"name":"Crippling Fear","description":"Night Stalker horrifies the target enemy Hero, causing it to miss attacks and become silenced. The effect lasts longer at night. A vision of the twisted maw of Balanar etches itself into the minds of the poor souls unlucky enough to cross his path.\n"},{"name":"Hunter in the Night","description":"Night Stalker is in his element at night, attacking and moving with great swiftness. The hunting prowess of Balanar improves as the night beckons.\n"},{"name":"Darkness","description":"Night Stalker smothers the sun and summons instant darkness, so that he might use his powers at their fullest. While Darkness is in effect, enemy heroes, units, wards and buildings have their vision range reduced to 675. Upgraded by Aghanim's Scepter: Grants unobstructed vision in the night. The improved vision is fully independent from Darkness. It is a humbling sight to see when the mightiest of warriors become afraid of the dark.\n"}],"type":"Strength","name":"Night_Stalker"}
{"_id":{"$oid":"59402ce3bfa46541761e3b73"},"lore":"Dota:Anub'arak was once the greatest champion of the Nerubians, but fell in the Second War of the Spider. He was resurrected by the Lich King Ner'zhul, who promised him eternal undeath in exchange for his unswerving loyalty. When threatened, he shoots these spikes through enemies, maiming and disorienting them. He channels his dark powers into a bolt of disarming negative energy, and those who witness him blending into the shadows of the frozen tundra have never lived to tell the tale. Dota 2:Deep in the Archive of Ultimyr, shelved between scholarly treatises on dragon cladistics and books of untranslatable spells, there is an ancient tome of entomological curiosities. Compiled by scholars, the book describes the telepathic talents of the zealot scarab, a strange species of social insect with abilities unique to all the seven planes.   The Nerubian Assassin starts off by wearing his opponents down early on, Burning their Mana for damage, keeping them fairly useless and vulnerable. With a Vendetta against living things, he can become invisible, travel faster, and deal great damage to the next thing he hits. Following up with his powerful line stunning impale and then Mana Burn is a combo most will instantly fall victim to--hard to see it coming and difficult to escape. His Scarabs can spy the lay of the land to alert him to danger or his next victim.","skills":[{"name":"Impale","description":"Rock spikes burst from the earth along a straight path. Enemy units are hurled into the air, then are stunned and take damage when they fall. All zealot scarabs possess intimate knowledge of underground pathways, using them to their advantage.\n"},{"name":"Mana Burn","description":"Destroys the target hero's mana equal to a multiplier of its Intelligence, and deals damage equal to the mana burned. The tome in Ultimyr describes one scarab with the ability to eat away at the minds of lesser beings.\n"},{"name":"Spiked Carapace","description":"When activated, Spiked Carapace reflects and negates damage dealt to Nyx Assassin (max once from each source), as well as stunning the source of the damage. While their carapaces are relatively thin, they're guarded by a retractable field of razor-sharp spikes.\n"},{"name":"Vendetta","description":"Allows Nyx Assassin to become invisible and gain a speed bonus. If Nyx Assassin attacks to break the invisibility, massive bonus damage is dealt with the attack. Upgraded by Aghanim's Scepter: Grants Nyx Assassin the Burrow ability. The scarab kills for the glory of his queen.\n"},{"name":"Burrow","description":"Nyx Assassin buries himself beneath the battlefield over 1 second. Once burrowed, Spiked Carapace instantly stuns nearby enemies when cast, the range of Mana Burn and Impale increase by 50%, and Impale's cooldown is decreased. While burrowed, Nyx Assassin is stationary, unable to attack and invisible. His health and mana regeneration are increased, and he gains 40% damage reduction. Some castes of Zealot scarab are known to create small burrows to lie in wait, ready to ambush their prey.\n"},{"name":"Unburrow","description":"Emerge from the burrow. Some castes of Zealot scarab are known to create small burrows to lie in wait, ready to ambush their prey.\n"}],"type":"Agility","name":"Nyx"}
{"_id":{"$oid":"59402ce3bfa46541761e3b74"},"lore":"Notes Dota 2: \"If you ask me, life is all about who you know and what you can find. When you live up in the Riftshadow Ruins, just finding food can be tough. So you need to cut corners, you need to scrounge, you need to know your strengths. Some of the beasts up there can kill you, so you need a way to trap the weak and duck the strong. On the upside, the ruins have history, and history is worth a lot to some people. There used to be a palace there, where they had all these dark rituals. Bad stuff. If you survived the ceremony, they would shatter a crystal and split your soul into pieces. They made great art though! Sculptures and such. Let me tell you: sometimes you stumble onto some of those old carvings. Take a pack full of those to town and sell them, then get yourself food for a few weeks. If luck is really on your side, you might find a Riftshadow crystal. Get it appraised and start asking around. Someone always knows some crazy fool looking for this kind of thing. If all else fails, sell it to a Magus the next time one's in town. They love that stuff. Still, whatever you do, be careful handling those crystals. You do not want one to go off on you. It really hurts.\"\u0009  Dota Allstars: Originally worshipped by the pagan tribes of Germania and the black forests that encompassed it, Meepo is a mischievous spirit of the earth who enjoys burying his enemies alive in mountains of rock spikes, pinning them down into helplessness as he pummels them into submission with his mighty shovel. The most disturbing of the Geomancer's powers, however, is his ability to separate his being into multiple selves, each as powerful as the original and making him potentially four times the trouble for the unlucky who encounter him.","skills":[{"name":"Earthbind","description":"Tosses a net at the target point, pinning down all units. Earthbind prevents invisibility, blink, and interrupts channeling. Catching dinner in the Riftshadow Ruins can be quite the task.\n"},{"name":"Poof","description":"Drawing mystical energies from the earth, a Meepo can teleport to another Meepo or itself after channeling for 1.5 seconds, dealing damage in both the departure and arrival locations. Sometimes breaking one of the Riftshadow Crystals can be just the trick for getting yourself out of a bind. Or your other self.\n"},{"name":"Geostrike","description":"Meepo enchants his weapon to deal damage per second, as well as slow the movement speed of the attacked unit. Geostrikes from multiple Meepos and illusions stack. Keeping your pack light and having few but versatile tools is the best bet for survival.\n"},{"name":"Divided We Stand","description":"Meepo summons an imperfect, semi-autonomous duplicate of himself, which can gain gold and experience as he does and shares his experience and abilities. However, the clones cannot wield any items but the boots that Meepo himself wears. If any of the clones die, they all die. Upgraded by Aghanim's Scepter: Adds an extra Meepo. Grants 100% shared attribute percentage*. Do I know you?\n"}],"type":"Agility","name":"Meepo"}
{"_id":{"$oid":"59402ce3bfa46541761e3b75"},"lore":" Dota Allstars: ","skills":[{"name":"Summon Wolves","description":"Summons two wolves to fight for Lycan. Level 2-4 wolves have Critical Strike, level 3-4 wolves have permanent invisibility, and level 4 wolves have 15 hp regen. The very enchantment that twisted his being also summons canine familiars.\n"},{"name":"Howl","description":"Grants bonus damage to Lycan, all allied heroes, and all units under their control. Blood-curdling wolf cries signal to opponents that Banehallow is among them.\n"},{"name":"Feral Impulse","description":"Increases the damage and attack speed of Banehallow and all units under his control.  His animalistic symbiosis with canine kind gives Banehallow enhanced reflexes and hunting capabilities.\n"},{"name":"Shapeshift","description":"Lycan assumes his lupine form, granting him critical strikes and added vision at night. During Shapeshift, Lycan and all units under his control move at increased speed and cannot be slowed. Forever a slave to his lycanthropy, Banehallow has come to accept his curse, and embrace his own savagery.\n"},{"name":"Wolf","description":"The Wolf summoned by Lycanthrope's Summon Wolves ability. Abilitied are detailed below and stats are detailed to the right.\n"},{"name":"Critical Strike","description":"Gives the wolves a bonus to critical hit. Unlocked upon leveling Summon Wolves to 2.\n"},{"name":"Invisibility","description":"Wolves become permanently invisible when not attacking. Unlocked upon leveling Summon Wolves to 3. Level 3 wolves retain Critical Strike.\n"}],"type":"Strength","name":"Lycanthrope"}
{"_id":{"$oid":"59402ce3bfa46541761e3b76"},"lore":"Dota Allstars:","skills":[{"name":"Mirror Image","description":"Creates three images of Naga Siren under her control. Slithice, while being strong in her own right, is notoriously hard to track down.\n"},{"name":"Ensnare","description":"Interrupts the target and traps them in place, preventing movement or blinking.The only way to escape the onslaught of a Slithereen is to never oppose one in the first place.\n"},{"name":"Rip Tide","description":"Naga Siren sends out a damaging wave of water that lowers armor. A torrent from the Deep Ones crushes the defenses of the Siren's enemies.\n"},{"name":"Song of the Siren","description":"All enemies in range of the Naga Siren are put into a magical stasis, where they cannot act or be attacked. Using Song of the Siren again will end the duration early. Upgraded by Aghanim's Scepter: Regenerates Naga Siren and nearby allies by 6% of maximum health per second for the duration. Slithice's powerful voice enchants leagues of opponents, while calling her Slithereen kin in a time of need.\n"},{"name":"Song of the Siren Cancel","description":"Release enemy units from your song so they can be targeted again.\n"}],"type":"Agility","name":"Naga_Siren"}
{"_id":{"$oid":"59402ce3bfa46541761e3b77"},"lore":"Dota Allstars: Although all Dryads are Cenarius' daughters, Aiushtha is said to be his first and favorite. Because of her direct relation to him, she has borrowed much of his power. This is demonstrated by her control over the shy Wisps which she uses to heal her allies, and her ability to bring an opponent under the will of the Sentinel. Preferring ranged combat to melee, she fashioned a spear that strikes with more force the further her target is away. Her agility is unmatched, and any opponent attempting to kill her will find she skips ahead of them with surprising ease. Dota 2:Aiushtha appears to be an innocent, carefree creature of the woods, and while this is certainly true, it is hardly the sum of her story. She well understands the suffering of the natural world. She has wandered far, and fared through forests bright and drear, in every clime and every season, gathering friends, sharing news, bringing laughter and healing wherever she goes. For in worlds wracked by war, forests are leveled for the building of ships and siege engines; and even in places of peace, the woods are stripped for the building of homes, and as fuel for countless hearths. Aiushtha hears the pleas of the small creatures, the furtive folk who need green shade and a leafy canopy to thrive. She lends her ears to those who have no other listeners. She carries their stories from the wood to the world, believing that her own good cheer is a kind of Enchantment, that can itself fulfill the promise of a verdant future. Enchantress, on first glance, seems to be an ordinary support hero, but this belies her aggressive offensive potential. With her Enchant ability, she can take control of forest creeps and their innate abilities. This provides her with a wide range of powers and gives her a strong way to push towers or gank enemy heroes. Enchant can also slow enemy heroes; this combined with her Untouchable passive skill makes her difficult to attack. The Enchantress can also use her Healing Wisps to heal her allies after a battle. Her hidden strength, however, is Impetus, which deals more damage the farther away the enemy hero is, adding massive damage to her basic attacks.","skills":[{"name":"Untouchable","description":"Enchantress beguiles her enemies, slowing their attacks when she is attacked. Lasts 4 seconds. After attacking Aiushtha, most opponents are overwhelmed with guilt having attacked such a natural beauty.\n"},{"name":"Enchant","description":"Enchantress charms an enemy, bringing it under her control (if a creep) or slowing it (if a hero). A true steward of the forest, Aiushtha befriends all within it - from lowly trolls to powerful centaurs.\n"},{"name":"Nature's Attendants","description":"A cloud of wisps heals Enchantress and any friendly units nearby. Lasts 10 seconds. Whimsical spirits of the woods possess a healing power that is quite subtle, but gains strength in numbers.\n"},{"name":"Impetus","description":"Places an enchantment on each attack while activated, causing it to deal additional damage based on how far away the target is. The farther the target, the greater the damage dealt.\nImpetus is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers. Upgraded by Aghanim's Scepter: Attack range increased*. While Aiushtha favors peaceful means, she is capable of a magical onslaught from a distance, her spears gaining energy from the natural life around her.\n\n"}],"type":"Intelligence","name":"Enchantress"}
{"_id":{"$oid":"59402ce4bfa46541761e3b78"},"lore":"Dota Allstars: Luna Moonfang is a stalwart and devout follower of the Moon Goddess, Elune. She fights alongside the Sentinel in the never-ending battle to cleanse the land of the unholy Scourge. Through her valiant efforts, she has been granted small portions of Elune's mystical power. Luna uses this gift to cut a swath through her enemies. It has been said that Luna is able to call down the very light of the moon, and is always surrounded by a glowing aura, as though in moonlight herself. Luna is a shining beacon for the Sentinel, an ever vigilant protector.","skills":[{"name":"Lucent Beam","description":"Luna channels a concentrated beam of lunar energy at an enemy, stunning and dealing damage. Selemene smites those who encroach upon the Nightsilver Woods.\n"},{"name":"Moon Glaive","description":"Allows Luna's glaive to bounce to enemy units near the attacked unit. Each bounce deals less damage. Carefully sharpened, Luna's boomerang-like weapon cuts a wide swath through enemy numbers.\n"},{"name":"Lunar Blessing","description":"Grants bonus damage to nearby allies, while blessing Luna with extra night vision. The Goddess of the Moon smiles upon her kin.\n"},{"name":"Eclipse","description":"Calls an eclipse that follows Luna, striking units with her current level of Lucent Beam. A single target can only be hit a maximum number of times. Unlike individual Lucent Beams, Eclipse does not stun. Eclipse turns day into night for 10 seconds. Upgraded by Aghanim's Scepter: Increases beams, duration, and max hits per unit. Allows Eclipse to be cast on an area within 2500 range. Grants obstructed vision of that area. Can also target any allied unit to center Eclipse on their location, even while moving. In times of great need, Selemene herself descends into the world, blocking out the light and hope of the opposed.\n"}],"type":"Agility","name":"Luna"}
{"_id":{"$oid":"59402ce4bfa46541761e3b79"},"lore":"More information required... Dota 2:","skills":[{"name":"Shockwave","description":"Magnus sends out a wave of force, damaging enemy units in a line. Mt. Joerlak was a somewhat unstable mass, and Magnus has learnt to channel its reverbations.\n"},{"name":"Empower","description":"Gives an allied unit bonus damage and cleave on attack. With a deep bellow, Magnus displays his true power.\n"},{"name":"Skewer","description":"Magnus rushes forward up to 800 distance, goring enemy units on his massive tusk. Units hit on the way will be dragged to the destination, then damaged and slowed. Magnoceros horns are valuable in direct proportion to their danger to prospective merchants.\n"},{"name":"Reverse Polarity","description":"Magnus changes properties of matter, sucking all nearby enemies in front of him and stunning them with a powerful slam and dealing damage. Magnus fights with the fury of the erupting Mt. Joerlak.\n"}],"type":"Strength","name":"Magnus"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7a"},"lore":"Dota 2:Deep amid the Upland crags and cliffs there runs a seam of sacred jade long foresworn by highland minders. From this rare material, the likeness of the great general Kaolin was carved and buried at the head of a stone funerary army ten thousand strong—a force of soldiers and holy men, jesters and acrobats, carved by crafstmen and entombed for millennia in the dark embrace of the Earth.","skills":[{"name":"Boulder Smash","description":"Earth Spirit smashes the target enemy or ally, sending them in the direction he is facing. If Earth Spirit targets an area, he will smash the nearest Stone Remnant in a 200 radius. The traveling unit or remnant damages all enemy units it hits. If an enemy is hit by a Stone Remnant, they are also stunned. Stone Remnants travel further than other units. It is with the power of a mountain that Earth Spirit strikes his enemies.\n"},{"name":"Rolling Boulder","description":"Earth Spirit gathers himself into a boulder and, after a 0.6s delay, rolls towards the target location, damaging enemy units. He will stop if he collides with an enemy hero or is stunned. If he rolls over a Stone Remnant, he will travel further and faster, and enemies hit by the boulder will have their movement speed slowed. Calling upon his connection to the land, the Earth Spirit draws loose stone to him, which forms a protective ball that he can use to roll short distances.\n"},{"name":"Geomagnetic Grip","description":"Earth Spirit pulls the target Stone Remnant or allied unit to his location. Enemies struck by the pulled target will be silenced, and take damage if the pulled target is a Stone Remnant. Like calls to like. Even the minerals found in the blood and bones of living beings are not immune to the call of the Earth Spirit.\n"},{"name":"Stone Remnant","description":"Call a Stone Remnant to the target location. Stones Remnants have no vision and are invulnerable, and can be used with Earth Spirit's abilities. Calling a Stone Remnant consumes a charge, which recharge over time. Earth Spirit calls forth a remnant of his stone army, long buried with him in the dark embrace of the Earth.\n"},{"name":"Magnetize","description":"Magnetizes units in a small nearby area, causing them to take damage for a short duration. Magnetized heroes cause nearby Stone Remnants to explode, destroying the remnant and refreshing Magnetize's duration on all nearby enemies. This process can repeat multiple times. If an enemy hero is affected silence or slows as a result of Geomagnetic Grip or Rolling Boulder, all magnetized heroes share the effects. Upgraded by Aghanim's Scepter: Enables the use of the Enchant Remnant ability. At the Earth Spirit’s call, the minerals in the blood and bones of his enemies rebel against the bodies they find themselves in.\n"},{"name":"Enchant Remnant","description":"Earth Spirit temporarily enchants a hero, granting them the properties of a Stone Remnant. After 3 seconds the remnant shatters, releasing the hero and damaging nearby enemies. Kaolin uses the elemental power of the Earth to temporarily petrify living beings, so that they might be conscripted into his stone funerary army.\n"}],"type":"Strength","name":"Earth_Spirit"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7b"},"lore":"She is also the only Hero to make a physical appearance in the Dota 2 comic. Dota Allstars: Traxex is an excellent DPS carry hero due to her Marksmanship and Trueshot aura which both increases her auto attack damage. Early game like most DPS carries she is fragile and some players choose to take one level of early silence to avoid a first blood attempt. She can do well with a Poor man's shield as it increases her raw damage and adds some resistance to harassment. She can take wraith bands to increase her raw damage, poor health and mana. Lothar's Edge is almost compulsory on Traxex as it gives her a escape mechanism and more damage. Black King Bar can replace Lothars because it gives her spell immunity for a period of time and increases her hp so its all down to preference. Most players prefer to max out Frost arrows first for orb-walking and harassing. There is an option next because both Trueshot Aura and Silence scale well into late game. Get Silence first if you wish to be a late game carry and Trueshot Aura first for a mid-game carry. Marksmanship is always taken whenever possible because unlike her other skills it doesn't scale well into the game. Late game items for her include Butterfly, Buriza and Monkey King Bar which all increase her damage and butterfly gives evasion. Manta style is also useful because it gives her images which deal extra damage and confuse the enemy. Another lesser used way of building Traxex is lifesteal and Monkey King Bar. However getting lifesteal destroys Traxex's chasing role because she then has no slow. However life steal gives her a lot more survivability.","skills":[],"type":"Agility","name":"Drow_Ranger"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7c"},"lore":"More information needed... Dota Allstars: Lucifer was the leader of the Doomguard attack force of the burning legion in the first attack by the dark lord Sargeras. With his original master long gone, Lucifer grants his undying loyalty to the Scourge to finish what his lord once started. Devouring the insignificant for his greed while dissipating the souls of those brave and strong enough to withstand his strength and the heat of his fiery haven of burning earth, Lucifer takes no prisoners and makes sure those who persevere through his wrath die by the agonizing and burning pain of Doom itself. Dota 2:He that burns and is not consumed, devours and is never sated, kills and is beyond all judgment—Lucifer brings doom to all who would stand against him. Bearing away souls on the tip of a fiery sword, he is the Fallen One, a once-favored general from the realm behind the light, cast out for the sin of defiance: he would not kneel.Six times his name was tolled from the great bell of Vashundol. Six and sixty times his wings were branded, until only smoking stumps remained. Without wings, he slipped loose from the tethers that bound him within the light and he fell screaming to earth. A crater in the desert, Paradise lost. Now he attacks without mercy, without motive, the only living being able to move freely between the seven dark dominions. Lashed by inescapable needs, twisted by unimaginable talents, the Doom Bringer carries his own hell with him wherever he goes. Defiant to the last. Eventually, the world will belong to Doom. Doom Bringer is a versatile and dangerous foe. His offensive spells are very damaging. Death allows him to pick off heroes at range, dealing extra damage against heroes of certain levels. The dreaded Doom is one of the most feared spells in the game, and with good reason. Not only does it deal massive Damage Over Time to its target, it also silences them completely for the duration. Although Doom Bringer is no pushover in physical combat, he lacks any dedicated fighting abilities. Instead, he uses Devour to take on the abilities of the creeps he ingests, and buffs his movement and attack speed with Scorched Earth. With his good income, strong damage spells, and the ability to effectively knock a single enemy hero out of a fight, Doom Bringer is a formidable opponent in any match-up.","skills":[{"name":"Devour","description":"Consumes an enemy or neutral creep, acquiring any special abilities that it possessed. Lucifer's appetite and greed are never sated.\n"},{"name":"Scorched Earth","description":"Carpets the nearby earth in flames, damaging enemies while Doom Bringer gains bonus HP regen and increased movement speed. The Fallen One spreads destruction in his wake, sparing none from the flame which sustains him.\n"},{"name":"LVL? Death","description":"Dissipates a piece of an enemy Hero's soul, mini-stunning and dealing bonus damage equal to 20% of the target's maximum health when the enemy's level is a multiple of a specific number or 25. Lucifer shares the fire branding bestowed upon him at the time of his exile.\n"},{"name":"Doom","description":"Inflicts a curse that prevents an enemy Hero from casting spells or using items, while taking damage over time. Upgraded by Aghanim's Scepter: Applies Break to target. Increases damage and duration. Duration doesn't count down while the target is within 900 range of Doom.*. Duration doesn't count down while the target is within 900 range of Doom. Disables passive skills. When a name is tolled from the bell of Vashundol, doom is sure to follow. \n"}],"type":"Strength","name":"Doom_Bringer"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7d"},"lore":"In sword forging furnaces of war, something powerful was taking shape. In a desperate bid to make superior weapons a sword smith by the name of Xin captured and bound a fire spirit to his forge. After countless hours of toil, a single pair of swords were born of the enchanted furnace. While holding and admiring the mystical blades the fire spirit was able to pass into Xin's body creating a being born of flesh and flame. Xin became more powerful than the soldiers he was tasked to outfit, and march out himself to dispatch the enemies of warmth and life. Equipped with burning steel and blazing speed, Xin tears through his enemies leaving nothing but a cinder. Xin is one of the few Agility heroes equipped to initiating roles in team fights and skirmishes. Using Fire Remnants' high mobility and Searing Chains for AOE disable, Xin is well suited for aggressive play style in both early and mid game, provided you have the manapool for it. Flame Guard offers some protection on magic damage, but don't expect it to save you from chain nukes or disables. Sleight of Fist is a mini version of Juggernaut's Omnislash that extends Xin's carry role into late game, not to mention invulnerability every 6 seconds.","skills":[{"name":"Searing Chains","description":"Ember Spirit unleashes up to 2 fiery bolas that wrap around nearby enemies, anchoring them in place and dealing damage each second. Xin's harshest lessons often employed the use of red-hot chains.\n"},{"name":"Sleight of Fist","description":"Ember Spirit dashes around with blazing speed, attacking all enemies in the targeted area and returns to where he was standing after. Deals bonus damage to heroes, and half-damage to creeps. An attack is performed every 0.2 seconds. Ember Spirit is invulnerable while dashing. The studied warrior must whip and weave through its enemies, burning each without pause.\n"},{"name":"Flame Guard","description":"Ember Spirit surrounds himself with a ring of fire that consumes incoming magic damage, leaving him unharmed. Flame Guard deals damage per second in an area around Ember Spirit while active. If the shield is broken, the damage is also lost. An enemy should never be allowed to approach without difficulty.\n"},{"name":"Fire Remnant","description":"Ember Spirit generates Fire Remnant charges every 35 seconds, with a max of 3 charges. Releasing a charge sends a Fire Remnant that runs to the target location at 2.5x Ember Spirit's speed. Using Activate Fire Remnant, Ember Spirit can dash out to his Remnants, exploding them for area of effect damage. The targeted Remnant will be arrived at last. By the spirit's power are Xin's teachings spread anew.\n"},{"name":"Activate Fire Remnant","description":"Select the Fire Remnant to arrive at. With blazing speed does a spirit fly!\n"}],"type":"Agility","name":"Ember_Spirit"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7e"},"lore":"Dota Allstars:","skills":[{"name":"Breathe Fire","description":"Unleashes a breath of fire on enemy units in a line in front of Dragon Knight damaging and reducing base damage for 8 seconds.   Knight Davion's breath has become that of the mighty Eldwurm Slyrak, remembered for burning numerous other knights to a crisp.\n"},{"name":"Dragon Tail","description":"Dragon Knight smites an enemy unit in melee range with his shield, stunning it while dealing minor damage. When in Elder Dragon Form, the cast range increases to 400. Davion's combination of dragon talents and knightly skills makes him a vicious opponent in melee combat.\n"},{"name":"Dragon Blood","description":"The life blood of the Dragon improves health regeneration and strengthens armor. Slyrak's blood still courses through Davion's veins, giving him twice the vitality of an ordinary knight.\n"},{"name":"Elder Dragon Form","description":"Dragon Knight takes the form of one of three powerful elder dragons, increasing his damage, speed, and Dragon Tail's range, while granting him new powers.\nLEVEL 1 Green Dragon: Corrosive Breath: attacks deal 100 poison damage over 5 seconds. Works on structures. \nLEVEL 2 Red Dragon: Splash Attack: attacks damage all enemy units in a 250 radius, with Corrosive Breath added to the primary target.\nLEVEL 3 Blue Dragon: Frost Breath: slows movement speed by 30%%, and attack speed by 20, of enemy units in Splash Attack range for 3 seconds, with Corrosive Breath added to the primary target. The dormant dragon power springs forth from within Davion, combining the powers of a legendary knight with a legendary Eldwurm. \n\n"}],"type":"Strength","name":"Dragon_Knight"}
{"_id":{"$oid":"59402ce4bfa46541761e3b7f"},"lore":"","skills":[{"name":"Thunder strike","description":"Repeatedly strikes the targeted unit with lightning. Each strike damages nearby enemy units in a small radius.   Disruptor's charged coils occasionally overload, and a singed armor plate or tuft of fur is the enemy's result.\n"},{"name":"Glimpse","description":"Teleports the target hero back to where it was 4 seconds ago. Instantly kills illusions.   Playing with electricity can have unexpected results.\n"},{"name":"Kinetic Field","description":"After a short formation time, creates a circular barrier of kinetic energy that enemies can't pass.   The stryder is immune to the gale-force winds that will consume its adversaries.\n"},{"name":"Static storm","description":"Creates a damaging static storm that also silences all enemy units in the area for the duration. The damage starts off weak, but increases in power over the duration.  Upgraded by Aghanim's Scepter: Static Storm silences items, and lasts an extra 2 seconds   A summer squall in Druud is a hardship that only an Oglodi can survive.\n"}],"type":"Intelligence","name":"Disruptor"}
{"_id":{"$oid":"59402ce4bfa46541761e3b80"},"lore":"Dota Allstars: Adept in the manipulation of frost and ice, Rylai is the very image of elegeance and grace. Trained by a renegade wizard deep in the heart of Winterspring, Rylai brings to the Sentinel her prowess in the arts of magic. With a vast arsenal of spells, she wreaks havoc upon her foes - be it with powerful blasts of frost to send them fleeing in panic, or be it by rendering them immobile in ice. Her foes tremble in fear as the ground beneath implodes in mighty novas of frost in a dazzling array, obliterating all who dare oppose her.  Dota 2: Born in a temperate realm, raised with her fiery older sister  Lina, Rylai the Crystal Maiden soon found that her innate elemental affinity to ice created trouble for all those around her. Wellsprings and mountain rivers froze in moments if she stopped to rest nearby; ripening crops were bitten by frost, and fruiting orchards turned to mazes of ice and came crashing down, spoiled. When their exasperated parents packed Lina off to the equator, Rylai found herself banished to the cold northern realm of Icewrack, where she was taken in by an Ice Wizard who had carved himself a hermitage at the crown of the Blueheart Glacier. After long study, the wizard pronounced her ready for solitary practice and left her to take his place, descending into the glacier to hibernate for a thousand years. Her mastery of the Frozen Arts has only deepened since that time, and now her skills are unmatched. The Crystal Maiden is a powerful disabler and support spellcaster. Each of her offensive spells impairs the enemy in some way, making her a valuable addition to any lineup. Crystal Nova blasts multiple enemies with chilling damage, while Frostbite completely paralyzes a single foe. Freezing Field causes immense damage and slows everything in a large area around her, but her natural fragility makes it a difficult spell to use to full effect. Her greatest asset to her team is Arcane Aura, which gives all her allies a significant boost to their mana regeneration, no matter where on the map they might be. Although she tends to take on a supportive role, the Crystal Maiden is still one of the most valuable heroes for any team.","skills":[{"name":"Crystal Nova","description":"A burst of damaging frost slows enemy movement and attack rate in the targeted area. The air temperature around Rylai drops rapidly, chilling all around her to the core.\n"},{"name":"Frostbite","description":"Encases an enemy unit in ice, prohibiting movement and attack, while dealing 50 damage every half-second. Lasts 10 seconds on creeps level 6 or lower. Rylai channels winds from the Blueheart Glacier, imprisoning attackers in thick blocks of ice.\n"},{"name":"Arcane Aura","description":"Gives additional mana regeneration to all friendly units on the map. This bonus is doubled on Crystal Maiden. Cold temperatures promote the essence of magic, causing Rylai's presence to allow spell usage in abundance\n"},{"name":"Freezing Field","description":"CHANNELED – Surrounds Crystal Maiden with random icy explosions that slow enemies and deal massive damage. Lasts 10 seconds. Upgraded by Aghanim's Scepter: Increases damage and slow*. Once the place of her exile, Icewrack has become an anchor for Rylai's frigid onslaught.\n"}],"type":"Intelligence","name":"Crystal_Maiden"}
{"_id":{"$oid":"59402ce4bfa46541761e3b81"},"lore":"DOTA Allstars:","skills":[{"name":"Penitence","description":"Forces an enemy unit to move slower and take more damage from attacks and spells. Although Chen's brand of animal enthrallment isn't quite strong enough to control the minds of enemy heroes, it still tests their resolve in combat.\n"},{"name":"Test of Faith","description":"Deals random damage to test an enemy unit's faith.Knights of the Fold possess a fanatical form of magic that is considered quite unwieldy by most other users of arcane arts.\n"},{"name":"Test of Faith (Teleport)","description":"Teleports an allied unit back to the base. Creeps are teleported instantly, while heroes have a delay before teleporting. If cast on Chen, all units controlled by Chen through Holy Persuasion will be teleported to him after a delay.\n"},{"name":"Holy Persuasion","description":"Gives control of an enemy or neutral creep, and gives it bonus HP. Upgraded by Aghanim's Scepter: Allows persuading Ancient Creeps.Although they may not be knights, Chen incorporates beasts into the Fold in the same way he himself was converted.\n"},{"name":"Hand of God","description":"Fully regenerates any creeps under Chen's control and heals all allied heroes on the map.Upgraded by Aghanim's Scepter:Reduces cooldown. Allows Holy Persuasion to target Ancient Creeps (maximum 1 Ancient Creep per level of Hand of God)*.Using the mental link with his thralls, Chen calls down restoration and well-being to those who share his fanaticism.\n"}],"type":"Intelligence","name":"Chen"}
{"_id":{"$oid":"59402ce4bfa46541761e3b82"},"lore":"Dota Allstars: Little is known to the Shadowtooth Clan, likely because this group of shadowy trolls never unveil the secrets of their mystifying sacrament. Nevertheless, the Loa they worship is much more powerful than most elementals, thus their favors must be kept in confidentiality. In return, these Primal Gods granted these trolls the power over paralyzing toxins, life-bending voodoo, and even endowment of life beyond the grave. A living eternity of death and misery, Dazzle now marches within the ranks of the undead, announcing the apocalypse of the Scourge that may lead them to much anticipated ascendancy. ","skills":[{"name":"Poison Touch","description":"Casts a poisonous spell on an enemy unit, causing it to take damage over time and be slowed for a set-in time. At level 2, the slow becomes twice as powerful after 2 seconds, and at levels 3 and 4, the target is stunned for 1 second after the slow. One of the few Dezun rites used for offensive purposes, the paralytic enchantment often proves useful.\n"},{"name":"Shallow Grave","description":"An ally blessed with Shallow Grave, no matter how close to death, cannot die while under its protection. Only a seasoned acolyte of the Shadow can properly perform the rite of preventing death.\n"},{"name":"Shadow Wave","description":"Shadow Wave heals several allies, which in turn cause damage equal to their healing in a small area around them. Dazzle is always healed by Shadow Wave. While it is a simplistic and routine rite among Shadow Priests, the Shadow Wave is also the most critical for success.\n"},{"name":"Weave","description":"Applies a buff that increases the armor of allied heroes while decreasing the armor of enemy heroes in the target area over time. Upgraded by Aghanim's Scepter: Increases radius and armor per second*. His ethereal journey into the Nothl realm has allowed Dazzle to mend together the powers of light and dark, creating shifting waves of enchantments.\n"}],"type":"Intelligence","name":"Dazzle"}
{"_id":{"$oid":"59402ce4bfa46541761e3b83"},"lore":"Dota Allstars: ","skills":[{"name":"Battery Assault","description":"Discharges high-powered shrapnel at random nearby enemy units, dealing minor magical damage and ministun. Some of Rattletrap's contraptions don't quite work correctly, so detonating them proves useful as an offensive maneuver.\n"},{"name":"Power Cogs","description":"Forms a barrier of energized cogs around Clockwerk, trapping any units that are near. Enemies outside the trap that touch a cog are knocked back, losing health and mana. Once a cog has delivered a shock, it will power down. Cogs can be destroyed by enemy attacks, but Clockwerk can destroy them with just one. One of Clockwerk's inventions of which he is most proud is the power cog - though it is sometimes despised by his allies.\n"},{"name":"Rocket Flare","description":"Fires a global range flare that explodes over a given area, damaging enemies and providing vision for 10 seconds. What started as a festive display has become a useful scouting and bombardment tool.\n"},{"name":"Hookshot","description":"Fires a grappling device rapidly at the target location. If the hook hits a unit, Clockwerk launches himself into the target, stunning and dealing damage. Any enemies Clockwerk collides with along the way are subject to damage and stunned. Upgraded by Aghanim's Scepter: Decreases Cooldown*. A somewhat unwieldy device, the Hookshot sends the otherwise clunky Clockwerk armor flying through the air.\n"}],"type":"Strength","name":"Clockwerk"}
{"_id":{"$oid":"59402ce4bfa46541761e3b84"},"lore":"Her spells are Carrion Swarm, Silence, Witchcraft (passive) and Exorcism (ultimate). DOTA Allstars: Krobelus spent her living days as a fervent member of a cult of Death Sayers. Her belief in the ways of death and the perfect harmony it brings has given her dead spirit a chance to wreak havoc among the chaotic living. She uses her abilities to call upon carnivorous bats and long dead spirits to lay to rest all who still pump blood through their veins. She augments her powers through the use of witchcraft, and she is able to make opponents gape in fear, losing the focus needed to cast spells. She is devoted to death in all it's aspects, and would see all turned to ash.DOTA 2:Krobelus was a Death Prophet—which is one way of saying she told fortunes for the wealthiest of those who wished to look beyond the veil. But after years of inquiring on behalf of others, she began to seek clues on her own fate. When death refused to yield its secrets, she tried to buy them with her life. But the ultimate price proved insufficient. Death disgorged her again and again, always holding back its deepest mysteries. Her jealousy grew. Others could die for eternity—why not she? Why must she alone be cast back on the shores of life with such tiresome regularity? Why was she not worthy of the one thing all other living creatures took for granted? Still, she would not be discouraged. Each time she returned from the grave, she brought a bit of death back with her. Wraiths followed her like fragments of her shattered soul; her blood grew thin and ectoplasmic; the feasting creatures of twilight took her for their kin. She gave a little of her life with every demise, and it began to seem as if her end was in sight. With her dedication to death redoubled, and no client other than herself, Krobelus threw herself ever more fervently into death's abyss, intent on fulfilling the one prophecy that eluded her: That someday the Death Prophet would return from death no more.","skills":[{"name":"Crypt Swarm","description":"Sends a swarm of winged beasts to savage enemy units in front of Death Prophet. Krobelus' many trips to the grave gather a flock of the damned.\n"},{"name":"Silence","description":"Prevents enemy units in a target area from casting spells. Peering into the veil of her opponent's demise, Krobelus sees a silent future.\n"},{"name":"Witchcraft","description":"Increases the potency of Death Prophet's spells by reducing costs and cooldowns, while providing a passive movement speed boost. Adds additional spirits to Exorcism. With each death, Krobelus adds necromantic power to her repertoire.\n"},{"name":"Exorcism","description":"Unleashes evil spirits to drain the life of nearby enemy units and structures. At the end of the spell's duration, Death Prophet is healed in proportion to the damage dealt. Lasts 30 seconds. Over time, the banshee remnants of her previous lives return to haunt the present.\n"}],"type":"Intelligence","name":"Death_Prophet"}
{"_id":{"$oid":"59402ce4bfa46541761e3b85"},"lore":"More information required... Dota Allstars: Thought by some to be among the most cunning and manipulative among the Scourge's varied champions, the dark seer Ish'kafel, living in exile from his people, is also the most secretive, for he speaks to no one but the Lich King himself. His unconventional talents, which lie in augmenting himself and allies with a variety of both defensive and offensive supportive castings, are quite unusual and versatile, often capable of turning the tide of battle before it even starts.","skills":[{"name":"Vacuum","description":"Dark Seer creates a vacuum over the target area that sucks in enemy units, disrupting them and dealing damage. Ish'Kafel modifies the center of gravity to a place of his choosing.\n"},{"name":"Ion Shell","description":"Surrounds the target unit with a bristling shield that damages enemy units in an area around it. The Dark Seer slices holes into the 'Land Behind the Wall,' causing prismatic energy to seep forth.\n"},{"name":"Surge","description":"Charges a target friendly unit with power, giving it a brief burst of maximum movement speed. Ish'Kafel once used his speed of mind to navigate the maze between the walls.\n"},{"name":"Wall of Replica","description":"Raises a wall of warping light that damages and creates replicas of any enemy hero who crosses it. Enemy replicas serve at the Dark Seer's will. Replicas last until they are destroyed, or until the wall's duration ends. Upgraded by Aghanim's Scepter: Increases the damage dealt by illusions*. The Dark Seer, while unable to return to his natural realm, can channel part of the prismatic wall with powerful strength of mind, sowing confusion amongst enemy ranks.\n"}],"type":"Intelligence","name":"Dark_Seer"}
{"_id":{"$oid":"59402ce4bfa46541761e3b86"},"lore":"Dota Allstars:The fire that kindles eternally on the visage of the fallen Elven Archer proves to others that his undeath was a mere genesis. Clinkz seeks perfection in the arts of fletching and never hesitates in sacrificing his own allies for the cause. Still retaining his ability to move with the wind, he is ready to slay the enemy officers with his swiftness and precision in archery. The Fletcher fires arrows that scorch the target with the heat of the Underworld, bringing them closer and closer to their peril. An elvish archer in life, a nightmare in death.DOTA 2:At the base of the Bleeding Hills stretches a thousand-league wood—a place called The Hoven, where black pools gather the tarry blood of the uplands, and the king-mage Sutherex sits in benevolent rule. Once a sworn protector of the Hoven lands, Clinkz earned a reputation for his skill with a bow. In the three-hundredth year of the king-mage, the demon Maraxiform rose from sixth hell to lay claim to the forest. In response, the king-mage decried an unbreakable spell: to any who slew the demon would be granted Life Without End.Unaware of the spell, Clinkz waded into battle, defending his lands against the demon’s fiery onslaught. Clinkz drove Maraxiform back to the gates of sixth-hell itself, where on that fiery threshold the two locked in a mortal conflict. Grievously wounded, the demon let out a blast of hellfire as Clinkz loosed his final arrow. The arrow struck the demon true as hellfire poured out across the land, lighting the black pools and burning Clinkz alive at the instant of the demon’s death. Thus, the mage’s spell took effect at the very moment of the archer’s conflagration, preserving him in this unholy state, leaving him a being of bones and rage, caught in the very act of dying, carrying hell’s breath with him on his journey into eternity.","skills":[],"type":"Agility","name":"Clinkz"}
{"_id":{"$oid":"59402ce4bfa46541761e3b87"},"lore":" Dota Allstars: A disciple of Mithras, the God of Chaos, Nessaj has utilized the powers bestowed upon him to further the cause of Chaos and Evil. He stands opposed with all his might against the powers of Order and Good. He uses his ability to call upon chaotic energy to damage and stun an enemy for a random length of time in conjunction with his power to rip holes in space to instantly strike down all that stand against him. His powers culminate into the terrifying Phantasm, creating avatars of himself who do full damage to all those who oppose him, confusing the battlefield and wreaking havoc amongst the forces of Good. Dota 2: The veteran of countless battles on a thousand worlds, Chaos Knight hails from a far upstream plane where the fundamental laws of the universe have found sentient expression. Of all the ancient Fundamentals, he is the oldest and most tireless—endlessly searching out a being he knows only as “The Light.” Long ago the Light ventured out from the progenitor realm, in defiance of the first covenant. Now Chaos Knight shifts from plane to plane, always on the hunt to extinguish the Light wherever he finds it. A thousand times he has snuffed out the source, and always he slides into another plane to continue his search anew.  Upon his steed Armageddon he rides, wading into battle with maniacal frenzy, drawing strength from the disorder of the universe. A physical manifestation of chaos itself, in times of need he calls upon other versions of himself from other planes, and together these dark horsemen ride into battle, as unstoppable as any force of nature. Only when the last Light of the world is scoured from existence will the search be ended. Where rides the Chaos Knight, death soon follows.","skills":[{"name":"Chaos Bolt","description":"Throws a mysterious bolt of energy at the target unit. It stuns for a random duration and deals random damage. Even Chaos Knight cannot predict this manifest of unholy energy.\n"},{"name":"Reality Rift","description":"Teleports you, any images you have and the target unit to a random point along the line between the two of you. Gives you bonus attack damage for one attack. Armageddon rides between the planes, bringing Chaos Knight to his victim wherever he may hide.\n"},{"name":"Chaos Strike","description":"Chaos Knight's mojo gives him a chance to deal bonus damage. Chaos Knight's unwieldy power bludgeons those who stand before him, crushing the thickest of armors.\n"},{"name":"Phantasm","description":"Summons several phantasmal copies of the Chaos Knight from alternate dimensions. There is a 50% chance an extra phantasm will be summoned. The phantasms deal full damage, but take double damage. Drawing on his battles fought across many worlds and many times, phantasms of the Chaos Knight rise up to quell all who oppose him.\n"}],"type":"Strength","name":"Chaos_Knight"}
{"_id":{"$oid":"59402ce5bfa46541761e3b88"},"lore":"Dota Allstars: ","skills":[],"type":"Agility","name":"Bounty_Hunter"}
{"_id":{"$oid":"59402ce5bfa46541761e3b89"},"lore":"More information needed...  Dota Allstars: Once an expendable spy, Jin'zakk has outlived the suicidal tendencies of other Bat Riders to create a unique style, one that favours control and precision instead of wanton destruction. His years of battle experience have allowed him to innovate creative uses for his fiery arts: He can douse enemies in a bath of sticky oil that restricts their movements before igniting it, fire an explosive that blows enemies away, or take flight to leave behind a trail of flame. However, his most deadly skill involves lassoing his opponent and dragging the unfortunate foe into the arms of his allies.  ","skills":[{"name":"Sticky Napalm","description":"Drenches an area in sticky oil, amplifying damage from Batrider's attacks and abilities and slowing the movement speed and turn rate of enemies in the area. Additional casts of Sticky Napalm continue to increase damage, up to 10 stacks. The extra damage is halved against creeps.\nIt's not uncommon to hear the Rider cackle while he increases the flammability of his opponents.\n\n"},{"name":"Flamebreak","description":"Hurls an explosive cocktail that explodes when it reaches the target location, knocking back, briefly stunning, and dealing damage over time to enemies in the area. A molotov cocktail is the weapon of choice for Batrider.\n"},{"name":"Firefly","description":"Batrider takes to the skies, laying down a trail of flames from the air. The fire damages any enemies it touches, and destroys trees below Batrider. While flying, Batrider gains unobstructed movement and vision. When an enemy escapes into the Yama Raskav Jungle, most would cut through the brush to find the fugitive. Batrider just chooses to destroy the jungle along with his foes.\n"},{"name":"Flaming Lasso","description":"Lassoes an enemy and drags them in Batrider's wake. Dragged units cannot move, attack, or use abilities. Teleporting or blinking will break the lasso. Few dare to ask to ride on the bat, as Batrider gives them free of charge.\n"}],"type":"Intelligence","name":"Batrider"}
{"_id":{"$oid":"59402ce5bfa46541761e3b8a"},"lore":"More information needed... Dota Allstars:An unusual hybrid of Demon and Orc, Strygwyr is an outcast amongst all mortal creatures. By thriving on and bathing himself with the blood of those he slays, Strygwyr can heal his wounds - even those that could prove fatal. Beware the fool who dares venturing alone, for Strygwyr can sense his blood miles away and gain vision through his helpless prey's eyes. Having ruptured the enemy with mighty blows in his bloodthirsty frenzies, Strygwyr corners his foe into making the impossible decision - bleed to death by trying to outrun the hasty demon, or be ripped to shreds in its awesome fury. Dota 2:Strygwyr the Bloodseeker is a ritually sanctioned hunter, Hound of the Flayed Twins, sent down from the mist-shrouded peaks of Xhacatocatl in search of blood. The Flayed Ones require oceanic amounts of blood to keep them sated and placated, and would soon drain their mountain empire of its populace if the priests of the high plateaus did not appease them. Strygwyr therefore goes out in search of carnage. The vital energy of any blood he lets, flows immediately to the Twins through the sacred markings on his weapons and armor. Over the years, he has come to embody the energy of a vicious hound; in battle he is savage as a jackal. Beneath the Mask of the Bloodseeker, in the rush of bloody quenching, it is said that you can sometime see the features of the Flayers taking direct possession of their Hound.","skills":[{"name":"Bloodrage","description":"Drives a unit into a bloodthirsty rage during which a unit deals, and takes, increased damage. Heroes affected by Bloodrage will be healed for 25% of the max health of any units they kill. Heroes affected by Bloodrage when killed will heal 25% of their max health to their killer. Strygwyr shares his animalistic thirst for bloodshed.\n"},{"name":"Blood Rite","description":"Bloodseeker baptizes an area in sacred blood. After 3 seconds the ritual completes, causing any enemies caught in the area to take damage and become silenced. The Flayed Twins are ever willing to aid those who spill blood upon the field of battle.\n"},{"name":"Thirst","description":"Enables Bloodseeker to sense enemy Heroes whose health is below a certain percentage wherever they are, giving him True Sight on that unit, increased movement speed and increased damage. Bonuses stack per Hero. Strygwyr becomes frenzied when blood is spilled.\n"},{"name":"Rupture","description":"Causes an enemy unit's skin to rupture, dealing massive damage. The affected unit takes damage based on how far it moves during the spell's duration. When the Bloodseeker hunts you, injuries become fatalities.\n"}],"type":"Agility","name":"Bloodseeker"}
{"_id":{"$oid":"59402ce5bfa46541761e3b8b"},"lore":"Dota Allstars: ","skills":[{"name":"Enfeeble","description":"Weakens an enemy unit, reducing its physical damage. Lasts 20 seconds.Even the mightiest of warriors crumble before the terror of Atropos.\n"},{"name":"Brain Sap","description":"Feasts on the vital energies of an enemy unit, healing Bane and dealing damage.Atropos finds no greater pleasure than to harvest the fear he creates.\n"},{"name":"Nightmare","description":"Puts the target enemy or friendly Hero to sleep and deals damage per second. Sleeping units are awakened when attacked, but the Nightmare passes to the attacking unit. The nightmared unit instantly wakes up if it takes damage.A stolen prowess from the goddess Nyctasha is to put his prey into forever sleep.\n"},{"name":"Nightmare End","description":"Wakes you up from a nightmare.\n"},{"name":"Fiend's Grip","description":"Channeled: Grips an enemy unit, disabling it and causing heavy damage over time, while stealing mana every second based on the unit's maximum mana. Lasts 5 seconds. Upgraded by Aghanim's Scepter: Increases damage per second, mana drain, and duration. Anyone who attacks Bane while he is channeling will be afflicted with Nightmare*.  Victims of Atropos are frequently torn apart by vivid conjurations of their own nightmares.\n"}],"type":"Intelligence","name":"Bane"}
{"_id":{"$oid":"59402ce5bfa46541761e3b8c"},"lore":"More information needed... Dota Allstars: In the war of Humans and Orcs that occured long ago many Orcish warriors were corrupted by demonic influence and became tools of blackest darkness. One such warrior was the leader of the Half-Tribe of the Bloodied Axe Clan; Mogul Kahn. Mogul was slain by human Paladins but mysteriously was seen fighting alongside the Scourge around the time Mannoroth started to command the Orcs in the war against Archimonde. The Axe has been revived by demons and uses his reflexes and powerful blows to hunt down and seek out the Sentinels' agile warriors and cut them down to size, even projecting his lust for war onto them. Dota 2:As a grunt in the Army of Red Mist, Mogul Khan set his sights on the rank of Red Mist General. In battle after battle he proved his worth through gory deed. His rise through the ranks was helped by the fact that he never hesitated to decapitate a superior. Through the seven year Campaign of the Thousand Tarns, he distinguished himself in glorious carnage, his star of fame shining ever brighter, while the number of comrades in arms steadily dwindled. On the night of ultimate victory, Axe declared himself the new Red Mist General, and took on the ultimate title of 'Axe.' But his troops now numbered zero. Of course, many had died in battle, but a significant number had also fallen to Axe's blade. Needless to say, most soldiers now shun his leadership. But this matters not a whit to Axe, who knows that a one-man army is by far the best.","skills":[{"name":"Berserker's Call","description":"Axe taunts nearby enemy units, forcing them to attack him, while he gains bonus armor during the duration. Mogul Khan's warcry taunts opponents into engaging in an unconquerable battle with the Axe.\n"},{"name":"Battle Hunger","description":"Enrages an enemy unit, causing it to be slowed and take damage over time until it kills another unit or the duration ends. Axe gains movement speed for each unit affected with Battle Hunger.Ordinary heroes cannot withstand Mogul Khan's rage for battle, such that it injures them until it is satisfied.\n"},{"name":"Counter Helix","description":"When attacked, Axe has a chance to perform a helix counter attack, dealing damage to all nearby enemies.Axe is the only reinforcement this army needs.\n"},{"name":"Culling Blade","description":"Axe spots weakness and strikes, dealing moderate damage but instantly killing an enemy unit with low health. When an enemy unit is killed in this way, Culling Blade's cooldown is refreshed and Axe and nearby allied units gain bonus movement  and attack speed. Upgradable by Aghanim's Scepter: Decreases cooldown, increases kill threshold, and increases the duration of movement speed upon kill*.Mogul Khan is the embodiment of battle and fury, launching into a gruesome fatality against those who dare engage the Axe in combat.\n"}],"type":"Strength","name":"Axe"}
{"_id":{"$oid":"59402ce5bfa46541761e3b8d"},"lore":"Dota Allstars:Twin sons to the great Prophet, Terrorblade and Magina were blessed with divine powers: Terrorblade granted with an unnatural affinity with life forces; Magina gifted with energy manipulation. Magina's eventual overexposure to the magics gradually augmented his elemental resistances and bestowed him the unique ability to move faster than light itself. Now, broken by Terrorblade's fall to the dark side, Magina answers the Sentinel's call in a desperate bid to redeem his brother. Every bitter strike turns the Scourge's evil essences upon themselves, culminating in a finale that forces his enemy to awaken to the void within and spontaneously implode.Dota 2:The monks of Turstarkuri watched the rugged valleys below their mountain monastery as wave after wave of invaders swept through the lower kingdoms. Ascetic and pragmatic, in their remote monastic eyrie they remained aloof from mundane strife, wrapped in meditation that knew no gods or elements of magic. Then came the Legion of the Dead God, crusaders with a sinister mandate to replace all local worship with their Unliving Lord's poisonous nihilosophy. From a landscape that had known nothing but blood and battle for a thousand years, they tore the souls and bones of countless fallen legions and pitched them against Turstarkuri. The monastery stood scarcely a fortnight against the assault, and the few monks who bothered to surface from their meditations believed the invaders were but demonic visions sent to distract them from meditation. They died where they sat on their silken cushions. Only one youth survived--a pilgrim who had come as an acolyte, seeking wisdom, but had yet to be admitted to the monastery. He watched in horror as the monks to whom he had served tea and nettles were first slaughtered, then raised to join the ranks of the Dead God's priesthood. With nothing but a few of Turstarkuri's prized dogmatic scrolls, he crept away to the comparative safety of other lands, swearing to obliterate not only the Dead God's magic users--but to put an end to magic altogether.","skills":[],"type":"Agility","name":"Anti-Mage"}
{"_id":{"$oid":"59402ce5bfa46541761e3b8e"},"lore":"More information required... Dota Allstars: Defeated in a battle long forgotten, this once great mage was banished to a tomb of ice for all eternity. For countless ages he lay in unbearable anguish until he was discovered by minions of the Lich King. In a vain attempt to gain favor with this ancient soul for his own purposes, the Lich King released him. But this soul no longer knew gratitude, it no longer knew friend from foe, it knew only pain. With it's body long since decayed, the soul took up the only form it knew. Consumed with hatred, even a touch from this monstrosity causes agony. Able to conjure devastating ice storms with a mere thought and hurl soul-shattering bolts of frost seemingly impossible distances, this creature punishes all who dare to stand their ground against it. Dota 2:","skills":[{"name":"Cold Feet","description":"Places a frozen hex on an enemy unit that deals damage over time, but can be dispelled by moving away from the initial cast point. If the enemy unit doesn't move out of the given range, it will be stunned and frozen in place after 4 seconds.Kaldr's presence draws those around him into a frozen void, threatening to lock them in an icy prison for eternity.\n"},{"name":"Ice Vortex","description":"Creates a vortex of icy energy that slows movement speed and increases magic damage done in its range. Lasts 12 seconds.Frozen, caustic winds are at the whim of Kaldr, chilling the field of battle.\n"},{"name":"Chilling Touch","description":"A frigid gust enchants allied heroes, granting them bonus magical damage for a given number of physical attacks, while slowing their attack speed slightly. Ancient Apparition always receives the buff. Lasts 30 seconds.The Ancient Apparition's eternal knowledge brings a frigid enchantment to his allies.\n"},{"name":"Ice Blast","description":"Launches a tracer towards any location of the battlefield, which must be triggered again to mark the area to be blasted by a damaging explosion of hail. The further the tracer travels, the larger the explosion will be. Enemies caught in the explosion, or who touched the icy ball of hail as it travels, are frostbitten, taking damage and prevented from regenerating or healing. If a frostbitten unit's health drops below a certain percentage, they will instantly shatter.  Upgraded by Aghanim's Scepter: Duration increased*.Ice storms from ages past flow through Kaldr's frosty limbs, crashing into the world and turning its inhabitants into monuments to his eternal power.\n"}],"type":"Intelligence","name":"Ancient_Apparition"}
